{
  "albumId": "Unleashed",
  "albumTitle": "Unleashed",
  "tracks": {
    "1": {
      "title": "Hard to Think",
      "hasLyrics": true,
      "lyrics": "You are gone now, shadows fill the room  
				This hollow place where light once bloomed  
				The ache starts low, a quiet swell  
				A tide that rises, a silent knell  

				My time of joy has slipped away  
				I sit and wait for light of day  
				Hoping for a glimpse, a stolen glance  
				Caught between two worlds in trance  

				Hard to think, when love’s entwined  
				You hold my heart, yet you're not mine  
				Lost completely in your smile’s grace  
				A bittersweet, unyielding embrace  

				I have fallen hardest of all  
				In your absence, I feel small  
				Your words a melody in the dark  
				They echo deep inside my heart  

				Your concerns become my own  
				Through suffering I have grown  
				To make you mine, to keep you near  
				To shield your soul, to calm your fear  

				Loving is all that truly matters now  
				Fragile hearts tied by an unspoken vow  
				In this quiet space where longing survives  
				I keep your love alive in my mind’s eye  
				 
				Hard to think, but harder still  
				To let go when love clings with iron will  
				Bound together by threads unseen  
				In love’s delicate, enduring dream"
    },
    "2": {
      "title": "Chicken Pigeon",
      "hasLyrics": true,
      "lyrics": "On the cracked dirt road where the wild winds roam,  
				A lonely pigeon flew, looking for a home.  
				Feathers worn from the battles of the sky,  
				He landed on a farm and he wondered why.  

				Clucking rhythms filled the morning air,  
				A flock of chickens without a single care.  
				He followed close, tried to learn their ways,  
				Found a quiet corner where his heart could stay.  

				Chicken pigeon, now you’re not alone,  
				Found a new sky beneath their rustic throne.  
				With wings of silver in a barn so warm,  
				You found your place inside the storm.  

				Red hair like fire in the early light,  
				She smiled at the pigeon, said, “You’re alright.”  
				With laughter running wild and eyes that see,  
				She gave him a home, set his spirit free.  

				The chickens gathered ‘round to welcome him near,  
				A harmony born from the surprise of a year.  
				On that little farm under open skies,  
				The pigeon finally found where truth lies.  

				Chicken pigeon, now you’re not alone,  
				Found a new sky beneath their rustic throne.  
				With wings of silver in a barn so warm,  
				You found your place inside the storm.  

				In the hush of evening, when the day is done,  
				The red-headed beauty and the flock become one.  
				From the smallest seed to the highest tree,  
				Love finds a way to set us free.  

				Chicken pigeon, now you’re not alone,  
				Found a new sky beneath their rustic throne.  
				With wings of silver in a barn so warm,  
				You found your place inside the storm.  

				Now you sleep with the chickens under stars so bright,  
				A patchwork family holding through the night.  
				Chicken pigeon, you took your chance,  
				Found your rhythm in this wild dance."
    },
    "3": {
      "title": "Complete",
      "hasLyrics": true,
      "lyrics": "In the quiet hum of midnight’s glow,  
				Your hands in mine, the world moves slow.  
				Every heartbeat echoes clear and true,  
				I’ve found my safe place here with you.  

				Beneath the stars, where whispers meet,  
				In your warm arms, I am complete.  

				Lost in the comfort of your steady gaze,  
				A gentle calm that never sways.  
				No fear to hide, no need to roam,  
				With you, my heart has found its home.  

				Beneath the stars, where whispers meet,  
				In your warm arms, I am complete.  

				Time may chase the fading light,  
				But love’s embrace will hold me tight.  
				No shadow falls when you're around,  
				In your arms, my peace is found.  

				Beneath the stars, where whispers meet,  
				In your warm arms, I am complete.  
				Yes, in your warm arms, I am complete."
    },
    "4": {
      "title": "Dance of Mirrors",
      "hasLyrics": true,
      "lyrics": "Fingers trace the glass, shrouded in a misty veil  
				Reflections blurred, your shadow dances soft and pale  
				Steam curls like secrets, hiding what my heart reveals  
				A tender flicker caught between the cold and warmth I feel  

				Your eyes, a quiet storm, pull me through this hazy night  
				Every frame a promise, every glance a spark of light  
				Slowly fading vapor, drawing lines where silence breaks  
				In this glassy ballroom, every breath a step we take  

				The mirror sighs as steam dissolves, revealing more than skin  
				A touch imagined, whispered close beneath the silvered grin  
				Each photo sent, a melody in voices never heard  
				Binding souls together without a single spoken word  

				Now the glass stands clear, no shadows left to intertwine  
				I see you standing there, heartbeat syncing close to mine  
				From smoky veils to naked truth, our worlds collide and spin  
				In your arms, the dance concludes; our love’s about to begin  

				Hands entwined, reflections melt, two souls no longer torn  
				The silent song of longing broken by the warmth of dawn  
				In every look, in every touch, the story finds its flame  
				In this dance of mirrors, I find your whispered name"
    },
    "5": {
      "title": "Lost in Love",
      "hasLyrics": true,
	  "lyrics": "I caught a glimpse, like summer light in your eyes  
				Every word you say feels like a sweet surprise  
				Spinning in a world where only we exist  
				Chasing every moment, falling through the mist  

				I'm lost in love, head over heels again  
				Caught inside a dream that never ends  
				Every heartbeat’s a melody so true  
				Lost in love, I’m lost in you  

				Late night talks and whispers under bright stars  
				Counting all the seconds till you’re in my arms  
				This crazy feeling that I never planned to find  
				You turned my world around, rewired my mind  

				I'm lost in love, head over heels again  
				Caught inside a dream that never ends  
				Every heartbeat’s a melody so true  
				Lost in love, I’m lost in you  

				No map, no guide, just this wild ride  
				Every step I take, you’re right by my side  
				Never knew a love could feel so brand new  
				Falling deeper, lost in you  

				I'm lost in love, head over heels again  
				Caught inside a dream that never ends  
				Every heartbeat’s a melody so true  
				Lost in love, I’m lost in you"
    },
    "6": {
      "title": "Red Alert",
      "hasLyrics": true,
      "lyrics": "Flames in her hair, a wild fire flare  
				She storms through the night without a care  
				Eyes like embers, burning the dark  
				Every step she takes ignites a spark  

				Red alert, the sirens scream  
				Caught in the blaze of a fiery dream  
				Heart on the line, can't play it smart  
				This red-headed beauty's captured my heart  

				Burning bright where the shadows part  
				Her fearless roar tears the cold apart  
				A force of nature, untamed, alive  
				In her wildfire, I come alive  

				Red alert, the sirens scream  
				Caught in the blaze of a fiery dream  
				Heart on the line, can't play it smart  
				This red-headed beauty's captured my heart  

				No backing down, no turning away  
				With every glance, she shakes my day  
				Strength in her soul, fire in her art  
				A red alert ringing loud in my heart  

				Red alert, the sirens scream  
				Caught in the blaze of a fiery dream  
				Heart on the line, can't play it smart  
				This red-headed beauty's captured my heart  

				Red alert, bright as a flame  
				Never the same, can't forget her name  
				Heart on the line, it's a brand new start  
				This red-headed beauty's captured my heart"
    },
    "7": {
      "title": "Waking Inside",
      "hasLyrics": true,
      "lyrics": "I want to wake inside the quiet halls of your mind,  
				Trace every corner where your secret dreams unwind,  
				Curl beneath the pulse that beats softly like a drum,  
				Find the breath where all beginnings come undone.  

				Touch every chamber where your heart hums low and deep,  
				Hold the gentle throb that never falls asleep,  
				Wrap inside the warmth you carry like a fire,  
				An endless spark that feeds our quiet desire.  

				Wake with you in the glow where love bends time and space,  
				Melt into the sigh that lines your sacred place,  
				Every imperfection blending into something pure,  
				Life’s fragile edges made whole and sure.  

				Inside your mind, your heart, your sacred skin,  
				I am the echo of where forever begins,  
				In your warmest depth, where only truth can stay,  
				I wake inside you, every single day.  

				Here, the world shifts soft, a miracle so real,  
				Love’s the equalizer that makes the broken heal,  
				In this endless waking, I find my only home,  
				Within you, I am never alone.  

				Wake with you in the glow where love bends time and space,  
				Melt into the sigh that lines your sacred place,  
				Every imperfection blending into something pure,  
				Life’s fragile edges made whole and sure.  

				Inside your mind, your heart, your sacred skin,  
				I am the echo of where forever begins,  
				In your warmest depth, where only truth can stay,  
				I wake inside you, every single day."
    },
    "8": {
      "title": "Freedom Tastes Fantastic",
      "hasLyrics": true,
      "lyrics": "I was shadowed in your storm, tangled in your chains  
				Every word a lightning strike, echoes of my pain  
				But the dark gave way to dawn when I saw the light  
				Packed up all the lies, left your ghost behind  

				Now I’m walking through the fire with my heart alive  
				No longer in your cage, it’s my time to rise  
				Every scar a story, every tear a spark  
				Freedom tastes fantastic when you break apart  

				You had me in a maze, but I found my way  
				Shattered all your mirrors, watch the pieces sway  
				I’m the crash of thunder, the roar inside the night  
				Stronger than the silence you tried to write  

				Now I’m walking through the fire with my heart alive  
				No longer in your cage, it’s my time to rise  
				Every scar a story, every tear a spark  
				Freedom tastes fantastic when you break apart  

				I’m spinning out of shadows, like a shooting star  
				No chains, no fences, just an open heart  
				I’m claiming every moment, fierce and unafraid  
				This is my rebellion, this is my crusade  

				Now I’m walking through the fire with my heart alive  
				No longer in your cage, it’s my time to rise  
				Every scar a story, every tear a spark  
				Freedom tastes fantastic when you break apart  

				Freedom tastes fantastic when you break apart  
				Freedom tastes fantastic... it’s a brand new start."
    },
    "9": {
      "title": "15 Minute Break",
      "hasLyrics": true,
      "lyrics": "Grabbing my phone, slipping out the door  
				Clock’s ticking loud, but I don’t feel the bore  
				Cranking up the tunes, blasting the bass  
				These 15 minutes are my saving grace  

				Smoking on the vape, hitting it hard  
				Clouds in the air like a deck of cards  
				Every drag fuels the fire inside  
				Getting ready to go back in—time to survive  

				The day’s a battle, faces all blurred  
				But in this moment, I’m the master of my world  
				The vape’s the compass, the beat’s my guide  
				15 minutes never felt so alive  

				Stepping to the parking lot, shadows in the heat  
				Faking a smile, thriving off this beat  
				I breathe in deep, let the worries fade  
				Armored up strong for the next charade  

				Blasting the bass, heart on the line  
				These 15 minutes make the chaos mine  
				No panic, no sweat, just the power to take  
				Reclaiming my space with each little break  

				The day goes faster, but I’m standing tall  
				Vape in my hand, I’m owning it all  
				15 minutes, yeah, they set me free  
				In this little escape, I find the real me"
    },
    "10": {
      "title": "Garage Grow",
      "hasLyrics": true,
      "lyrics": "Hole in the roof covered by leaves  
				Sunlight slips in through the trees  
				Humidity rising, spring’s alive  
				Green worlds where my dreams thrive  

				Locked out once more, but I won’t stay down  
				Time to jimmy that old steel crown  
				Haven’t seen my babies in days  
				Hope the watering keeps the praise  

				Garage grow, yeah, we’re taking control  
				Biggest buds, yeah, we’re on a roll  
				Dank green shines in every glow  
				From the shadows, watch us grow  

				Leaves like velvet, stems so strong  
				Twisting stories all night long  
				Every stalk a work of art  
				With a fire burning in my heart  

				Locked out, but I’m breaking through  
				For the harvest that I’m due  
				The garage door, it’s time to knock  
				Coming in to rock this block  

				Garage grow, yeah, we’re taking control  
				Biggest buds, yeah, we’re on a roll  
				Dank green shines in every glow  
				From the shadows, watch us grow  

				Smoke the fattest, light it slow  
				From seed to flame, watch how we flow  
				Empowered roots beneath the floor  
				In this garage, we own the war  

				Garage grow, yeah, we’re taking control  
				Biggest buds, yeah, we’re on a roll  
				Dank green shines in every glow  
				From the shadows, watch us grow  

				Yeah, from the shadows, watch us grow."
    },
    "11": {
      "title": "Packing Power",
      "hasLyrics": true,
      "lyrics": "I lace my boots tight, steel on my side  
				Walking through fire, got no place to hide  
				Fists clenched, heart beating like a war drum  
				They try to test me, but I don’t succumb  

				Every step a statement, I’m my own damn shield  
				Armor on my skin, never gonna yield  
				Locked and loaded with a fierce roar inside  
				You want a battle? Well, I’ll be your guide  

				Packing power, ready to ignite the flame  
				Armed to the tits, and I’m owning this game  
				No backing down, I don’t take their shit  
				Unbreakable, unshakable, made to hit  

				Storms may come, but I’m standing tall  
				I built these walls to never fall  
				Taking what’s mine, no apologies given  
				My spirit’s a bullet, straight and driven  

				Echoes of thunder, I’m rattling the ground  
				In this wild fight, I wear the crown  
				Charging forward, blazing my own trail  
				Fueling the fire when the weak hearts fail  

				Packing power, ready to ignite the flame  
				Armed to the tits, and I’m owning this game  
				No backing down, I don’t take their shit  
				Unbreakable, unshakable, made to hit  

				I’m the storm you prayed would pass  
				The rebel soul that kicks your ass  
				Carrying strength you can't ignore  
				I’m the fight, the fire, and so much more  

				Packing power, stinging like a kiss  
				Armed to the tits, taking no shit, this is bliss  
				Fearless and wild, I’m done with the lies  
				I’m the thunder, the lightning in the skies"
    },
    "12": {
      "title": "Parking Lot People",
      "hasLyrics": true,
      "lyrics": "Sitting in my truck watching them come and go  
				Rehabbers and all, shadows moving slow  
				Kept their stories locked behind those doors  
				Dragging out, dragged in, another broken floor  

				Sad show right at the door, faces worn and torn  
				I don’t know no more, is this a place I’m sworn?  
				Watching from the lot, waiting for the night  
				Time to go back in, hold my ground and fight  

				Mandated rehab, but the clock’s off track  
				They let ’em out too early, still carrying the crack  
				But I’ve got more to give, got my head held high  
				Learned to dance in storms and look the devil in the eye  

				Sitting in my truck watching them come and go  
				Counting up the scars that only we could know  
				Making just a bit more time before I leave  
				Watching parking lot people, hoping they believe  

				All the walls could fall, and I’d still stand tall  
				Out here on the edge, but I’m owning it all  
				Every step, every fall, it’s mine to keep  
				Watching parking lot people, I’m done counting sheep  

				Sitting in my truck watching them come and go  
				Rehabbers and all, moving in with hopes  
				Dragged out but not broken, just bending with the fight  
				Watching parking lot people ‘til I find my light"
    },
    "13": {
      "title": "Roadtrip",
      "hasLyrics": true,
      "lyrics": "Packed the car with busted dreams and a stubborn kind of hope,
				Kids whispering in backseat, dodging shadows on this slope,
				No paper maps, just basslines pounding out the night,
				Every mile a little closer to where wrong fades out of sight.

				This roadtrip ain’t no fairy tale or soft parade,
				It’s a crooked track to one who dares to stay,
				Windows down, the bass shakes what’s left of pain,
				No rewinds, no reruns, just freedom after rain.

				Left behind the mess, the blame, the bitter edges worn,
				Now it’s dark humor and honest scars, tired but reborn,
				Kids clutching blankets, we’re running from the past’s sharp fires,
				But the rearview only shows the dust and false desires.

				This roadtrip ain’t no fairy tale or soft parade,
				It’s a crooked track to one who dares to stay,
				Windows down, the bass shakes what’s left of pain,
				No rewinds, no reruns, just freedom after rain.

				Older hands that steady, not the storms we used to claim,
				A crooked smile, a warm voice calling out my name,
				The highway hums with secrets, dark but full of light,
				This isn’t perfect, but it’s ours to fight.

				This roadtrip ain’t no fairy tale or soft parade,
				It’s a crooked track to one who dares to stay,
				Windows down, the bass shakes what’s left of pain,
				No rewinds, no reruns, just freedom after rain."
    },
	    "14": {
      "title": "Power of the 'Tism",
      "hasLyrics": true,
      "lyrics": "Check the mind, complex grind, ain't no regular kind,  
				It's the 'tism, isn't it? Lights flash behind my eyes blind,  
				Unseen power, underestimated tower,  
				Checker king moves, beats drop, I own the hour.  

				Yeah, it’s the tism, they whisper when they stare,  
				Doesn’t phase me, I’m built for this, unaware,  
				They don’t know or they don’t care, just mimic and glare,  
				But inside the storm, I’m calm, fountain rare.  

				Power of the 'tism, it runs deep like the ocean,  
				Flows through circuits in my brain with vivid emotion,  
				Sidewalks shake when I step, thought patterns create,  
				That puzzle solver, never fall, always elevate.  

				That’s the question and the answer, wrapped in a beat,  
				We rise like giants in this heat, no retreat,  
				From the shadows to the front, always stand tall,  
				No scripts, no chains, no backs to the wall.  

				Power of the 'tism, that’s what they whisper when they stare,  
				They don’t know or they don’t care, I’m beyond compare,  
				No matter how low they go, we go with the flow,  
				Cause inside the storm, we got the power of the 'tism, yo.  

				Checker king, beats them all, always the towering fall,  
				Brains wired sharp, call it the 'tism call,  
				Energy electric, spark it, ignite the room,  
				Unbreakable spirit, rising from the gloom.  

				Yeah, it’s the tism, it’s the core, the heart and the flame,  
				Every challenge, every step, we redefine the game,  
				Never just obstacles, but fuel for the rise,  
				Power of the 'tism seen clear through these eyes.  

				Power of the 'tism, that’s what they whisper when they stare,  
				They don’t know or they don’t care, but we’re always aware,  
				No matter how low they go, we go with the flow,  
				‘Cause we got the power of the 'tism, and now you know."
    }
  }
}



