{
  "albumId": "Afterlight",
  "albumTitle": "Afterlight",
  "tracks": {
    "1": {
      "title": "Afterlight",
      "hasLyrics": true,
      "lyrics": "We held the sky beneath our feet,\nThrough thunder's roar and midnight's beat,\nShards of night still cling inside,\nBut in this glow, we learn to rise.\n\nEvery shadow fades to light,\nThere's a pulse here, burning bright,\nEchoes of the storms we've braved,\nFuel the dawn we thought we'd saved.\n\nAfterlight, we catch the flame,\nNot the end, just something changed,\nBreath of new, a whispered fire,\nFrom the ruins, climbing higher.\n\nTides have shifted, clouds dispersed,\nSilhouettes of what's been lost,\nYet in the breath of morning's hush,\nWe find the strength to build, to rush.\n\nAfterlight, the space between,\nWhere pain dissolves, but memories lean,\nNot a close, but open door,\nTo a world we're ready for.\n\nWe trace the stars with open eyes,\nKnowing storms were just disguise,\nThe calm's not peace, but energy,\nA spark to light what's yet to be.\n\nAfterlight, alive and clear,\nA better beginning drawing near,\nFrom cracked earth to skies reclaimed,\nWe step forward, unashamed."
    },
    "2": {
      "title": "Real Ones Stay",
      "hasLyrics": true,
      "lyrics": "Walked through shadows, felt the coldest rain,\nBut you never slipped away, you stayed inside my pain,\nNo empty words, no echoes in the dark,\nJust a steady heartbeat, you anchored my spark.\n\nLoyalty's a language spoken without sound,\nIn every silent moment that you stuck around,\nNot promises made in the heat of the night,\nBut the weight of your presence, holding me tight.\n\nReal ones stay, when the world fades away,\nWhen the nights get long and the colors gray,\nYou're the steady flame in a storm that rages,\nFound strength in your eyes across all these pages.\n\nFought my demons, heard you call my name,\nNot asking for saving, just that you remain,\nYou see through the cracks where the light falls in,\nAnd in every broken place, you still begin.\n\nNo hustle, just muscle on the ties that bind,\nYou're the constant truth when I lose my mind,\nNot empty lips, but hands that don't stray,\nYou showed me real love is the real ones who stay.\n\nReal ones stay, when the world fades away,\nWhen the nights get long and the colors gray,\nYou're the steady flame in a storm that rages,\nFound strength in your eyes across all these pages.\n\nNo promises spoken, just being there,\nIn the silence that says, \"I'll always care,\"\nLoyalty louder than the loudest words said,\nShe sees it now — it's the life we've led.\n\nReal ones stay, when the world fades away,\nWhen the nights get long and the colors gray,\nYou're the steady flame in a storm that rages,\nFound strength in your eyes across all these pages."
    },
    "3": {
      "title": "Gas in the Tank",
      "hasLyrics": true,
      "lyrics": "Clock's ticking loud, but I'm still moving fast\nWalls closing in, but I won't be the last\nBurned out, worn thin, yeah, my shadow's long\nBut there's fire inside, feels like a new dawn\n\nNo time to stop, no time to break\nGot too much life still left to take\nBruised and tired, but I'm running still\nFuel in my veins, mind set to thrill\n\nHeart's a thunderbeat, roaring down the line\nMiles behind me but I'm chasing time\nEvery scar, every fall, just noise in the dark\nExhaustion's a whisper—can't drown this spark\n\nNo time to stop, no time to break\nGot too much life still left to take\nBruised and tired, but I'm running still\nFuel in my veins, mind set to thrill\n\nGas in the tank, and I'm tearing through\nShadows chasing but I'm breaking through\nShake off the dust, throw down the chain\nThe night is young, and I'm wide awake\n\nNo time to stop, no time to break\nGot too much life still left to take\nBruised and tired, but I'm running still\nFuel in my veins, mind set to thrill\n\nNo time to stop, no time to break\nI'm alive, I'm awake\nStill tired, still bruised, but I'm racing the flame\nGas in the tank—running wild, untamed."
    },
    "4": {
      "title": "Skyline Kids",
      "hasLyrics": true,
      "lyrics": "Neon lights and city dreams, beneath the stars we used to chase\nNow they're stepping through the streams of tomorrow's open space\nEchoes of us in their stride, louder beats beneath their feet\nWhispers in the night collide, futures tangled, bittersweet\n\nSkyline kids with eyes on fire, burning up the endless sky\nThey'll go farther than we did — that's the point, we can't deny\nHold the silence, hold the years, quiet fears and louder hopes\nWe built ladders, now they climb, breaking wide beyond the ropes\n\nHands that once wrote faded lines, now paint worlds in electric hues\nEvery spark rewrites the signs, every step finds something new\nWe watch close but let them fly, shadows dance beneath their wings\nIn their wings, the morning sighs, hear the sound of brighter rings\n\nSkyline kids with hearts ablaze, dancing past the roads we knew\nEyes to futures we can't trace, in their light the old feels new\nHold the silence, hold the years, quiet fears and louder hopes\nWe built ladders, now they climb, breaking wide beyond the ropes\n\nThey'll go farther, let them run, chasing down the rising sun\nIn their story, we're the dawn, but their journey's just begun\nSkyline kids, the night's alive, futures born in city glow\nWaves of light where dreams survive, watch them rise, watch them grow"
    },
    "5": {
      "title": "No Blueprint",
      "hasLyrics": true,
      "lyrics": "Started with a spark, no script in my hand\nWe're architects of chaos, building on sand\nNo blueprint, no guide, just heart and the plan\nStep by step, we carve out a new land\n\nScratch the old lines, redraw every frame\nOur family's a puzzle with no rules to name\nWoven from scars, stitched tight without shame\nIn the silence, we light up the flame\n\nThe future's DIY — that's beautiful, see?\nNo map to the stars, just you and me\nA rhythm unknown but a steady beat\nWe rise from the ground, take back the street\n\nWe fold paper dreams into origami skies\nTearing up old books, we write new rhymes\nBuilding bridges with words, no need for signs\nIn this house of our making, no end lines\n\nLaughter's the mortar, trust is the beam\nReality bends to fit our dream\nEvery crack's a story, every struggle a theme\nTogether we're stronger, an unstoppable team\n\nThe future's DIY — that's beautiful, see?\nNo map to the stars, just you and me\nA rhythm unknown but a steady beat\nWe rise from the ground, take back the street\n\nNo blueprint means freedom, no rules to contain\nLike rivers flowing wild, breaking every chain\nWe craft our own legacy, bold and untamed\nThis is our family, and we build it unashamed\n\nSo here's to the builders with hands in the clay\nShaping tomorrow in their own unique way\nNo blueprint, no limits, no debts to repay\nJust love and the courage to light up the day\n\nThe future's DIY — that's beautiful, see?\nNo map to the stars, just you and me\nA rhythm unknown but a steady beat\nWe rise from the ground, take back the street"
    },
    "6": {
      "title": "Messy Forever",
      "hasLyrics": true,
      "lyrics": "We don't tie up every loose end,\nWe fall hard, then rise again.\nScars and stories in our skin,\nThis messy life we're living in.\n\nWe crash, we burn, but we don't break,\nLove's real in the mess we make.\nEvery fight, every laugh, every weird Tuesday,\nIt's ours — no clean lines, no cover-up, no fade.\n\nMessy forever, wild and untamed,\nFlaws and passion, we own our name.\nIn the chaos, hearts beat stronger,\nHold on tight, we last much longer.\n\nYou paint outside the perfect frame,\nI wear my chaos like a flame.\nMessy love, no apologies,\nRaw and honest, that's our story.\n\nMessy forever, wild and untamed,\nFlaws and passion, we own our name.\nIn the chaos, hearts beat stronger,\nHold on tight, we last much longer.\n\nNo need to hide, no script to follow,\nThis love's a ride, not a shallow echo.\nEvery crack, every bend, every stumble and shuffle,\nIt's ours — messy forever, and it's beautiful."
    },
    "7": {
      "title": "Open Door Days",
      "hasLyrics": true,
      "lyrics": "Sunlight spills across the floor,\nCoffee brewing, neighbors at the door,\nLaughter bouncing off these painted walls,\nIn this place, no silence calls.\n\nWe're dancing wild in the kitchen light,\nRadio's loud, setting hearts alight,\nBreakfast smells that pull you close,\nIn these moments, we find the most.\n\nPeace isn't silence — it's freedom to be loud,\nSinging off-key with the windows open proud,\nOpen hearts and hand in hand,\nBuilding dreams where we all stand.\n\nCrack the day like a fresh new page,\nTrade the past, start a brand new stage,\nEvery story told without a care,\nTraditions born from the electric air.\n\nWe're chasing dawn with the sun in flight,\nMaking noise in the quiet night,\nOpen door days where the wild get free,\nThis is home, where we're meant to be.\n\nPeace isn't silence — it's freedom to be loud,\nSinging off-key with the windows open proud,\nOpen hearts and hand in hand,\nBuilding dreams where we all stand.\n\nYeah, breakfast smells and loud guitars,\nFilling every beat of our open hearts,\nIn these rooms where the spirit stays,\nWe live out loud on open door days."
    },
    "8": {
      "title": "Barefoot Proof",
      "hasLyrics": true,
      "lyrics": "She sheds the skin of yesterday,\nDust curls from her fingertips;\nThe fire in her veins beats steady,\nEchoes in the pulse of the earth.\n\nNo glass to shatter underfoot,\nNo armor made from broken dreams;\nShe spins in the wild, open spaces,\nRoots tangled deep in whispered streams.\n\nSometimes healing looks like dancing barefoot,\nTurning storms into melodies loud and new.\nNo heels, no mask — she walks her own earth,\nA fierce and tender soul born true.\n\nBeneath the sky that knows her name,\nShe moves like thunder carved from light;\nEach step a promise, bold and burning,\nA sacred rhythm, dark and bright.\n\nHer laughter breaks the silent ceiling,\nThe air hums soft with ancient songs;\nFreedom grows in barefoot circles,\nWhere shattered pasts no longer belong.\n\nSometimes healing looks like dancing barefoot,\nTurning storms into melodies loud and new.\nNo heels, no mask — she walks her own earth,\nA fierce and tender soul born true.\n\nBarefoot proof, she claims the sky,\nGrounded flame, she will not hide;\nWith every beat, her heart declares,\n\"I am home, alive, alive.\"\n\nSometimes healing looks like dancing barefoot,\nTurning storms into melodies loud and new.\nNo heels, no mask — she walks her own earth,\nA fierce and tender soul born true."
    },
    "9": {
      "title": "Blood & Hope",
      "hasLyrics": true,
      "lyrics": "In the shadow of the fathers, where the silence lies,\nChains forged in bitter fires, but the spirit flies.\nWe walk the broken lines, rewrite the ancient code,\nFrom ashes rise the titans, this is how we change a legacy.\n\nBlood thick with stories told in scars and pain,\nHope like a river breaking through the strain.\nThe hands we hold are new, forged in a different flame,\nThe things we pass down, the ones we end.\n\nHear the drums thunder, feel the sky ignite,\nGenerations turning, shadows into light.\nNo more echoes of the past can bind us in their grip,\nWe seize the dawn, we sail beyond the slip.\n\nBlood thick with stories told in scars and pain,\nHope like a river breaking through the strain.\nThe hands we hold are new, forged in a different flame,\nThe things we pass down, the ones we end.\n\nRise with fire, rise with heart,\nBreak the cycle, tear it apart.\nFrom old wounds blooms a new refrain,\nBlood and hope in every vein.\n\nBlood thick with stories told in scars and pain,\nHope like a river breaking through the strain.\nThe hands we hold are new, forged in a different flame,\nThe things we pass down, the ones we end.\n\nThis is how we change a legacy —\nBlood and hope, blood and hope."
    },
    "10": {
      "title": "Midnight Groceries",
      "hasLyrics": true,
      "lyrics": "Cruisin' down these quiet streets, just past midnight's glow\nNeon flickers in the rearview, where the soft winds blow\nGot the cart rolling easy, stacking up the night's little finds\nLaughing at the echoes of our jokes we left behind\n\nIt's not the grand adventures, not the mountains we climb\nIt's the slow dance in the kitchen, stirring up our time\nWith every whispered secret and every soft-set phrase\nWe're caught in the magic lurking in these everyday days\n\nMidnight groceries, lighting up the aisles in our eyes\nSimple lives blending under cobalt city skies\nThe soundtrack's just some beats, bass lines and silent peace\nIn the hum of fluorescent lights, our worries find their release\n\nPop the top, sip it slow, the chill that fills this space\nEvery glance, every smile, a quiet embrace\nWe're fingerprints on cereal boxes, mischief tucked in rows\nDancing 'round the mundane like the river gently flows\n\nMidnight groceries, lighting up the aisles in our eyes\nSimple lives blending under cobalt city skies\nThe soundtrack's just some beats, bass lines and silent peace\nIn the hum of fluorescent lights, our worries find their release\n\nNo need for the rush, no need for the fight\nJust the ordinary moments holding us tight\nThe little things awake us, all the small delights\nThat make the night glow soft in these city lights\n\nMidnight groceries, lighting up the aisles in our eyes\nSimple lives blending under cobalt city skies\nThe soundtrack's just some beats, bass lines and silent peace\nIn the hum of fluorescent lights, our worries find their release"
    },
    "11": {
      "title": "Firewatcher",
      "hasLyrics": true,
      "lyrics": "I step back into the quiet, where your light bends with the smoke,\nYour fire's breathing colors with no need to choke,\nI trace the edges of your flame, a silent vow in my chest,\nNot to tame the fire's dance, just to watch it manifest.\n\nI'm not here to fix her — just to witness her shine,\nNot to draw the lines, but to hold the space that's mine.\nLike a firewatcher, eyes steady through the dark,\nLove's the ember glowing without leaving a mark.\n\nYou flicker wild, untethered, like the wind's own song,\nNot a cage, not a chain, just a place to belong.\nI carry no bucket to douse what's fierce and bright,\nBut a steady flame to meet you in the night.\n\nI'm not here to fix her — just to witness her shine,\nNot to draw the lines, but to hold the space that's mine.\nLike a firewatcher, eyes steady through the dark,\nLove's the ember glowing without leaving a mark.\n\nBeneath the cracked sky where the spirits play,\nI'll stand behind your warmth and never steal away.\nNot a firestarter, nor the one who pulls the string,\nJust the quiet echo of the song you sing.\n\nI'm not here to fix her — just to witness her shine,\nNot to draw the lines, but to hold the space that's mine.\nLike a firewatcher, eyes steady through the dark,\nLove's the ember glowing without leaving a mark."
    },
    "12": {
      "title": "Roots Before Rockets",
      "hasLyrics": true,
      "lyrics": "We dig deep in the soil, where the fire starts to grow\nHands in the earth, feeling every seed we sow\nThe sunrise wakes the dreamers, voices rising strong\nWe're building something slowly, knowing where we belong\n\nYou don't fly till your feet find the steady, solid ground\nRoots before rockets, that's the way we're heaven-bound\nHold the flame of the moment, but steady is the sound\nYou don't fly till your feet find the steady, solid ground\n\nFrom the echoes of the forests to the pounding of the streets\nEvery pulse a promise, every heartbeat keeps\nThe rhythm of the people, a chorus bold and wide\nWe lift with every breath, but stand with every stride\n\nYou don't fly till your feet find the steady, solid ground\nRoots before rockets, that's the way we're heaven-bound\nHold the flame of the moment, but steady is the sound\nYou don't fly till your feet find the steady, solid ground\n\nRaise your hands to the sky, but keep your roots in the land\nDreams like rockets high, but grounded is how we stand\nTogether in this moment, voices strong and loud\nWe're rising with the sunrise and the beating of the crowd\n\nYou don't fly till your feet find the steady, solid ground\nRoots before rockets, that's the way we're heaven-bound\nHold the flame of the moment, but steady is the sound\nYou don't fly till your feet find the steady, solid ground"
    },
    "13": {
      "title": "See It Through",
      "hasLyrics": true,
      "lyrics": "Hold tight, the night is thick with promises we made,\nNo slipping through the cracks, this bond will never fade.\nThrough storms that shake our ground, together we will stand,\nRooted in the love we've grown, hand in hand.\n\nNo whispers of quitting, no shadows of doubt,\nThis fire that we carry, it's what we're singing about.\nIt's not about the new start, or where we could have been,\nIt's the strength in every moment, the fight inside the win.\n\nThis time, no one's backing out, we see it through,\nWith every breath, with all we've got, our hearts stay true.\nHold fast, light up the sky, a beacon shining strong,\nIt's not about starting over — it's about finishing strong.\n\nThrough winding roads and endless days that test our will and soul,\nWe find our harmony in being whole.\nThe laughter and the tears, the memories we've spun,\nWe're weaving our forever, and we've only just begun.\n\nThis time, no one's backing out, we see it through,\nWith every breath, with all we've got, our hearts stay true.\nHold fast, light up the sky, a beacon shining strong,\nIt's not about starting over — it's about finishing strong.\n\nWhen the world feels heavy, and shadows fall like rain,\nWe lift each other up again and again.\nThe road may be long but our spirits are high,\nTogether we reach for the endless sky.\n\nThis time, no one's backing out, we see it through,\nWith every breath, with all we've got, our hearts stay true.\nHold fast, light up the sky, a beacon shining strong,\nIt's not about starting over — it's about finishing strong."
    }
  }
}