{
  "albumId": "Awakenings",
  "albumTitle": "Awakenings",
  "tracks": {
    "1": {
      "title": "Eyes Open Wide",
      "hasLyrics": true,
      "lyrics": "Flashing neon promises turned to ashes in my hands\nDancing in the daylight but I never understood the plans\nSugar-coated stories cracking like a vinyl side\nLaughing through the chaos, but I'm no place to hide\n\nEyes open wide, but the colors bleed to gray\nCaught between the noise and the words I never say\nEyes open wide, feel the tectonic shift inside\nBreaking through the glitter for a second time alive\n\nMorning breaks, the mirror's whisper's sharp and clear\nBroken fairy tales I sold, now disappear\nEvery smile a shadow, every truth a disguise\nI was blind in technicolor, now I see through all the lies\n\nEyes open wide, but the colors bleed to gray\nCaught between the noise and the words I never say\nEyes open wide, feel the tectonic shift inside\nBreaking through the glitter for a second time alive\n\nI wore my innocence like a vintage dress\nWas it naive, or just useless?\nSkinned knees and headlines on repeat\nI won't fake that spark, I'll rise from underneath\n\nEyes open wide, but the colors bleed to gray\nCaught between the noise and the words I never say\nEyes open wide, feel the tectonic shift inside\nBreaking through the glitter for a second time alive\n\nEyes open wide, no more lullabies tonight\nUnderneath the flashing lights, I finally see the fight\nEyes open wide, chasing dawn inside the night\nDisillusion's just the moment before the flight"
    },
    "2": {
      "title": "Clean Cut",
      "hasLyrics": true,
      "lyrics": "I sharpened all my edges, polished every line\nNo more colors fading in your skyline\nYou used to be the shadow, pulled me into night\nNow I'm breaking free, stepping into light\n\nI'm clean cut, no ragged edges left to show\nI'm rising up, watch me take control\nNo more chains, I choose where I belong\nThis is my fight song, my heart beating strong\n\nYou tried to cut me down, said I wouldn't rise\nBut I'm lightning in a bottle, fire in disguise\nEvery scar you left just made me whole\nI'm building walls of steel around my soul\n\nI'm clean cut, no ragged edges left to show\nI'm rising up, watch me take control\nNo more chains, I choose where I belong\nThis is my fight song, my heart beating strong\n\nI'm done with broken mirrors, reflection's new\nI'm glowing wild and fearless, through and through\nBoundaries set, I'm soaring on my own\nA warrior standing tall, reclaiming home\n\nI'm clean cut, no ragged edges left to show\nI'm rising up, watch me take control\nNo more chains, I choose where I belong\nThis is my fight song, my heart beating strong\n\nI'm clean cut, I'm clean cut\nFrom the ashes now, I'm unstoppable—untouched"
    },
    "3": {
      "title": "Breathe Again",
      "hasLyrics": true,
      "lyrics": "Shadows crashing like waves on the shore\nHeavy clouds weaving through my core\nA tempest tangled deep in my chest\nBut the dawn is breaking, giving no rest\n\nI was drowning in whispers, tangled in fears\nHeld captive by echoes of silent tears\nBut heat from the lightning, sparks to the flame\nNow the skies are shifting, I'm shedding the pain\n\nI can breathe again, like the first sun on skin\nClearing the storm, letting light rush in\nChest rising, hearts flying, wild like the wind\nI can breathe again, I can breathe again\n\nStorms may gather, thunder may roar\nBut the calm is coming, brighter than before\nEvery heartbeat a rebellion, breaking free,\nA song in the chaos, healing endlessly\n\nFrom the ashes, wings unfold wide\nRising higher, no need to hide\nThe weight is lifting, the darkness thins\nThe light in my chest, it starts to sing\n\nI can breathe again, like the first sun on skin\nClearing the storm, letting light rush in\nChest rising, hearts flying, wild like the wind\nI can breathe again, I can breathe again\n\nLet the winds carry the past away\nFeel the rush of this golden day\nWith every breath, a fearless friend\nI'm alive, I'm whole, I breathe again"
    },
    "4": {
      "title": "Glass Skin",
      "hasLyrics": true,
      "lyrics": "Sliding through the shadows, a whisper in the dark\nFragile like the morning, but I'm lighting up the spark\nLines like cracks on porcelain, catching every light\nBut under all this shimmer, I'm a fire burning bright\n\nGlass skin, feel the tremble, but I'm never gonna break\nSoft edges, sharp angles, harder than they take\nLayers fold like paper, tears fall like rain\nBut under this surface, I'm unchained from the pain\n\nDon't mistake my quiet for a heart that's still\nEvery silence hiding an iron will\nYou see the shimmer, but don't see the steel\nA delicate fortress you'll never unseal\n\nGlass skin, feel the tremble, but I'm never gonna break\nSoft edges, sharp angles, harder than they take\nLayers fold like paper, tears fall like rain\nBut under this surface, I'm unchained from the pain\n\nWhisper loud in the echoes, dancing on the edge\nEvery crack a story, every scar a pledge\nFragile like the petals, fierce like the thorn\nIn this tender battle, I am reborn\n\nGlass skin, feel the tremble, but I'm never gonna break\nSoft edges, sharp angles, harder than they take\nLayers fold like paper, tears fall like rain\nBut under this surface, I'm unchained from the pain\n\nGlass skin, breaking myths that they make\nFragile but unbreakable, never fake"
    },
    "5": {
      "title": "Reset",
      "hasLyrics": true,
      "lyrics": "City lights flicker in my rearview,\nNeon sins trace the lines I once knew,\nLost in the haze of the mistakes that I made,\nBut the night's got a promise, it's calling my name.\n\nHigh-rise nights, they're dancing with my past,\nShadows of regret, but this feeling's gonna last,\nI'm breaking out, yeah, I'm breaking free,\nFrom the chains of the man I used to be.\n\nReset the game, wipe the slate clean,\nRewrite the stars in this retro dream,\nNo more falling, no more lies,\nI'm soaring now, watch me touch the skies.\n\nFlashing signs and the rhythm's on fire,\nGlowing hearts that spark my desire,\nEvery scar's just a story I'll leave behind,\nIn this neon glow, a new love I'll find.\n\nReset the game, wipe the slate clean,\nRewrite the stars in this retro dream,\nNo more falling, no more lies,\nI'm soaring now, watch me touch the skies.\n\nFrom the ashes of my own design,\nI'm rising up, and the night's divine,\nSelf-sabotage was a ghost in the past,\nTonight I'm alive, this feeling will last.\n\nReset the game, wipe the slate clean,\nRewrite the stars in this retro dream,\nNo more falling, no more lies,\nI'm soaring now, watch me touch the skies."
    },
    "6": {
      "title": "Unlearn Me",
      "hasLyrics": true,
      "lyrics": "Wake me from the drought of old regrets,\nLet rivers run through where the darkness set,\nI'm shedding skin like autumn sheds the tree,\nOh, unlearn me, unchain me, set me free.\n\nThe fire in my bones once burned with lies,\nA storm of shadows danced behind my eyes,\nNow the morning breaks, and I'm ready to see,\nThe sky rewrite the story inside of me.\n\nUnlearn me, let your wild winds blow,\nRip the roots and let the new seeds grow,\nI'm a bird reborn from the cage of my dreams,\nFlying high through uncharted streams.\n\nBeneath the ache of winter's hollow breath,\nLies the quiet song of a thousand resets,\nI'll drink the rain, let the thunder be,\nThe thunder of a soul unlearning to break free.\n\nUnlearn me, let your wild winds blow,\nRip the roots and let the new seeds grow,\nI'm a bird reborn from the cage of my dreams,\nFlying high through uncharted streams.\n\nThe sun will rise in my restless heart,\nPainting maps for a brand-new start,\nWhere the ghosts of the past fall to their knees,\nI'm rising up, unbound, unlearned, and free."
    },
    "7": {
      "title": "Chrysalis",
      "hasLyrics": true,
      "lyrics": "Wrap me tight in silence, weave the threads of night\nShadows dance around me, but I'm burning bright\nFrom the ashes of a cocoon, I break and breathe anew\nSpinning webs of wild fire, unlearn the old and true\n\nTake this fractured heart, stitch the cracks with flame\nLost inside the fragments, calling out your name\nInner light ignites, a thousand dawns unfurl\nIn the rhythm of the drums, I shed the broken world\n\nUnlearn me, unravel me, let me drift and fly\nTouch the sky with trembling wings, burn the dark goodbye\nUnlearn me, unchain the sea, flood the earth and sky\nRise from hollow echoes now, a phoenix amplified\n\nWhispers in the hollow, songs of silver rain\nBodies swell with thunder, pounding through the veins\nFrom the silent chrysalis, to wild and open fields\nBreaking free, the light reveals the fire that it sealed\n\nUnlearn me, unravel me, let me drift and fly\nTouch the sky with trembling wings, burn the dark goodbye\nUnlearn me, unchain the sea, flood the earth and sky\nRise from hollow echoes now, a phoenix amplified\n\nNow the night is folding, woven into gold\nI am light, I am becoming, fearless, fierce, and bold\nHear the tribal heartbeat, join the cosmic dance\nIn the pulse of breaking dawn, I find my second chance\n\nUnlearn me, unravel me, let me drift and fly\nTouch the sky with trembling wings, burn the dark goodbye\nUnlearn me, unchain the sea, flood the earth and sky\nRise from hollow echoes now, a phoenix amplified"
    },
    "8": {
      "title": "Noise Floor",
      "hasLyrics": true,
      "lyrics": "Fingers trace the static lines, a pulse beneath the whisper roar\nCracked screens flicker, bleeding light—fractured signals on the floor\nCities hum a neon dream, tangled webs of feedback noise\nI'm tuning out to find the seam where silence speaks in coded voice\n\nCaught inside this wireframe, a sphere of scrambled thought and sound\nEvery echo forging chains, a maze where calm can't yet be found\nBut somewhere deep the quiet wakes, a breath beneath the shattered sky\nA hollow space the chaos breaks, a place where all the colors die\n\nLet me linger in the noise floor, beneath the waves and endless spin\nWhere coded shadows open doors and let the silence creep back in\nThough the outside world may race, and every pixel bends and breaks\nI'll find refuge in this place, where stillness rises up and takes\n\nBroken circuits singing low, a fractured choir's delicate hum\nWhispers caught in undertow, the beat that makes the chaos run\nIn the static I am whole, a pulse untouched by storm or fight\nNoise and stillness wrestle soul—here inside, I find my light\n\nLet me linger in the noise floor, beneath the waves and endless spin\nWhere coded shadows open doors and let the silence creep back in\nThough the outside world may race, and every pixel bends and breaks\nI'll find refuge in this place, where stillness rises up and takes"
    },
    "9": {
      "title": "Echo Chamber",
      "hasLyrics": true,
      "lyrics": "You say, \"Stay in line, don't tilt the frame\"\nBut I don't want to wear your same old name\nWhispers bounce like shadows in the hall\nI hear your echoes, but I don't fall\n\n\"Blend in, stay quiet, don't make a scene\"\nMy heart's a drum, beats outside your routine\nYou want the mirror, reflecting your face\nI'm breaking glass, reclaiming my space\n\nNo walls can hold the voice I've found\nIn this echo chamber, I'm breaking sound\nYou're calling out, but I'm tuning free\nNot your silhouette, I'm me, I'm me\n\n\"Why fight the tide, won't you drown with us?\"\nI swim against, I'm made of different dust\nYour noise fades out when I take the stage\nWords layered deep break out from the cage\n\n\"No masks, no scripts, just clear and loud\"\nA rebel pulse beneath the crowd\nYour echo's shadow fades to grey\nI'm alive in my own way\n\nNo walls can hold the voice I've found\nIn this echo chamber, I'm breaking sound\nYou're calling out, but I'm tuning free\nNot your silhouette, I'm me, I'm me\n\nI'm me, I'm me, I'm breaking sound\nI'm me, I'm me, I'm breaking sound"
    },
    "10": {
      "title": "Post Hero",
      "hasLyrics": true,
      "lyrics": "I'm not the shadow they paint on their walls\nNot the myth that keeps towers tall\nI'm the echo left when the silence calls\nBreaking chains where their idols fall\n\nNo crowns, no silver tongues to wear\nI'm the fire in the open air\nStrength isn't found in the flashing lights\nIt's in the fight that you choose to fight\n\nI'm post-hero, real and unrefined\nNo masks to hide the truth behind\nIn the ashes of their plastic throne\nI found a power all my own\n\nForget the legends made of gold\nI'm the story that's yet untold\nNot chasing fame or fading starlight\nJust rising in my own right\n\nI'm post-hero, standing on my ground\nNo louder noise can drown me out\nAuthenticity's the throne I claim\nMore than glory or a name\n\nThe weight of greatness they demand\nCrumbles in my steady hands\nI redefine what strength can be\nA heart that beats unapologetically\n\nI'm post-hero, real and unrefined\nNo masks to hide the truth behind\nIn the ashes of their plastic throne\nI found a power all my own\n\nI'm post-hero, standing on my ground\nNo louder noise can drown me out\nAuthenticity's the throne I claim\nMore than glory or a name\n\nI'm post-hero, this is my fight\nNo borrowed light, just burning bright\nBeyond the lies and spotlight's glow\nI choose the strength to just be whole"
    },
    "11": {
      "title": "Static Bloom",
      "hasLyrics": true,
      "lyrics": "In the hush where the willows sway,\nSilent waves hum electric gray,\nFrozen petals catch the light,\nStillness blooms beneath the night.\n\nRoots unwind beneath the skin,\nWhispering quiet where I begin,\nVeins of silver trace the air,\nIn this pause, I find me there.\n\nStatic bloom, rise through the sound,\nColors pulse without a sound,\nFragile nerves in calm consume,\nLife renews in static bloom.\n\nBreath drifts slow on velvet streams,\nCradled deep in soft daydreams,\nShadows flicker, gently spin,\nFrom the quiet, life begins.\n\nLeaves like whispers, soft and true,\nFalling slow, they paint the blue,\nIn the still I'm breaking through,\nBreathe in light, a world anew.\n\nStatic bloom, rise through the sound,\nColors pulse without a sound,\nFragile nerves in calm consume,\nLife renews in static bloom."
    },
    "12": {
      "title": "CTRL-ALT-DEL",
      "hasLyrics": true,
      "lyrics": "Pixels flicker, neon bleed, electric dreams in overdose\nSynthetic heartbeat syncs with mine, wired veins start to close\nData streams wash over me, a flood I can't contain\nFragile code, corrupted soul, rebooting in the rain\n\nFires burn through circuits tight, melting plastic skin\nVoices glitch in static nights, where do I end, and you begin?\nFragmented self in digital hell, shadows splice and splice\nBreathless in this chrome metropolis, breaking bits of ice\n\nCTRL-ALT-DEL, cleanse the system, start again\nErase the overload, rise from ashes of the sin\nCTRL-ALT-DEL, reset the future, free the mind\nBinary phoenix, born to fly, leave the code behind\n\nWires twist, electric bliss, synapse sparks ignite\nA flicker flash, a crash, a bash, rewiring day to night\nNeon gods in chrome disguise, data rain will fall\nI shed my skin, implode within, rise to claim it all\n\nPixels blur, I'm breaking through, fragments knit and weave\nA digital pulse, a million suns, new life from what I leave\nSynthwave tears and motherboard fears dissolve in electric sea\nThe future's born from cracking doors, releasing all of me\n\nCTRL-ALT-DEL, cleanse the system, start again\nErase the overload, rise from ashes of the sin\nCTRL-ALT-DEL, reset the future, free the mind\nBinary phoenix, born to fly, leave the code behind"
    },
    "13": {
      "title": "Awakenings",
      "hasLyrics": true,
      "lyrics": "Waiting on the edge of morning light,\nHands undone from the fears of night,\nEvery shadow fades as colors pull me through,\nA canvas wide, the sky of something new.\n\nRise, like the sun from restless seas,\nBreaking chains in the whispering breeze,\nHere I stand on the brink of all I've known,\nOpen roads ahead, I'm coming home.\n\nLift me higher, hear the choir sing,\nWings unfold in the flight of spring,\nEvery heartbeat's a drum, a call to dance—\nCaught in the moment, caught in chance.\n\nTurn the page and the world rewinds,\nFinding pieces I left behind,\nIn the mirror, I finally see the friend I used to dream,\nCircular paths that lead back to me.\n\nRise, like the sun from restless seas,\nBreaking chains in the whispering breeze,\nHere I stand on the brink of all I've known,\nOpen roads ahead, I'm coming home.\n\nLift me higher, hear the choir sing,\nWings unfold in the flight of spring,\nEvery heartbeat's a drum, a call to dance—\nCaught in the moment, caught in chance.\n\nAwaken now, the morning calls,\nThis is life as the curtain falls,\nFrom dusk to dawn, the story's untold—\nA full circle, brave and bold.\n\nRise, like the sun from restless seas,\nBreaking chains in the whispering breeze,\nHere I stand on the brink of all I've known,\nOpen roads ahead, I'm coming home.\n\nLift me higher, hear the choir sing,\nWings unfold in the flight of spring,\nEvery heartbeat's a drum, a call to dance—\nCaught in the moment, caught in chance."
    }
  }
}