{
  "albumId": "Exit Wounds",
  "albumTitle": "Exit Wounds",
  "tracks": {
    "1": {
      "title": "Exit Wounds",
      "hasLyrics": true,
      "lyrics": "Cracked ground beneath these feet,\nEchoes of a heart that won't retreat,\nFalling hard but never done,\nFire's cold when the night's begun.\n\nScars don't mean weakness, no disguise,\nThey're maps of battles won, not lies,\nLines of truth on skin and bone,\nProof I'm the only soul I own.\n\nI'm still bleeding — that means I'm still here,\nFighting shadows, chasing clear,\nBroken glass beneath my stride,\nCut through storms, I won't hide.\n\nRising loud from shattered frames,\nAshes blaze with untamed flames,\nVoices screaming through the smoke,\nEvery wound's a spoke I spoke.\n\nI'm still bleeding — that means I'm still here,\nLiving proof of pain survived by fear,\nCold but real, the wounds remain,\nInk of life in every stain.\n\nTurn the pain into a spark,\nLight up tunnels dark and stark,\nEvery exit wound I bear,\nSigns I made it through the snare.\n\nI'm still bleeding — that means I'm still here,\nSteel and fire, edge sincere,\nScars don't mean weakness —\nThey mean you got out alive."
    },
    "2": {
      "title": "Teeth in the Mirror",
      "hasLyrics": true,
      "lyrics": "Cracked reflections flash in static light\nI'm the echo of a scream you never heard at night\nSkin stretched tight over bones that bite\nSurvival's tattoo, jagged and bright\n\nSlipped through the cracks, yeah, I learned to bend\nBeneath the pressure where the weak just end\nBut I'm not breaking, no, I'm not your friend\nI'm the growl in the dark that won't pretend\n\nTeeth in the mirror, jagged and sharp\nNot just scars, I'm the fire in the dark\nEvery fracture fed the hunger in my heart\nSome break, others grow fangs — tearing apart\n\nLips split from screaming silence loud\nBuilt from rubble, standing unbowed\nBlackened edges in a shiny crowd\nI'm the nightmare you invited proud\n\nRoots that twisted, hard and raw\nSurvival's dance is a jagged law\nLost my innocence, I don't feel the flaw\nI wear my teeth like a brutal claw\n\nTeeth in the mirror, jagged and sharp\nNot just scars, I'm the fire in the dark\nEvery fracture fed the hunger in my heart\nSome break, others grow fangs — tearing apart\n\nNo apology for the beast inside\nI'm the riptide you can't hide\nFeral, fearless, electrified\nIn this chaos, I'm alive\n\nTeeth in the mirror, jagged and sharp\nNot just scars, I'm the fire in the dark\nEvery fracture fed the hunger in my heart\nSome break, others grow fangs — tearing apart"
    },
    "3": {
      "title": "Deadweight Deluxe",
      "hasLyrics": true,
      "lyrics": "Sinking ships and weighted chains, I'm done with all your poison veins\nTalkin' loud but I don't hear, your deadweight dragging through my fear\nSharp tongue cuts a jagged line, slicing off the lost, the weak, the blind\nDon't owe you space inside my head—when I'm drowning, I'm already dead\n\nBreak the leash, hear the snap, slam the door—I'm never going back\nFlip the script, savage grin, sarcastic bite under my skin\nKnives of freedom, slash your ties, watch me rise while your empire dies\nThank you for the deadweight deluxe, I'm airborne now, no room for rust\n\nYou're the anchor, I'm the storm, fierce and free, I transform\nBlood and fire in my chest, I'm the queen of this unrest\nChains dissolve to dust and ash, toxic voices turned to trash\nScreaming loud—this is my fight, cutting loose, I claim the night\n\nBreak the leash, hear the snap, slam the door—I'm never going back\nFlip the script, savage grin, sarcastic bite under my skin\nKnives of freedom, slash your ties, watch me rise while your empire dies\nThank you for the deadweight deluxe, I'm airborne now, no room for rust\n\nDon't owe you a reason, don't owe you a damn thing\nWhen you drown beneath your burdens, you learn how to spread wings\nSavage smiles and violent freedom, I'm the storm you never chased\nDeadweight deluxe, it's my new name—pull me under? I erased."
    },
    "4": {
      "title": "Kinda Lived",
      "hasLyrics": true,
      "lyrics": "When the silence wraps around like a winter's cloak,\nAnd the pulses slow, like they've gone broke,\nYou tell yourself it's peace in disguise,\nBut the thunder roars behind these glassy eyes.\n\nWhen they think you're dead, smile wide and freak 'em out,\nDance on the edge of shadows, scream what you're about,\nNumbness isn't peace, it's a quiet riot's shout,\nI kinda lived, in the spaces they forgot to count.\n\nFingers trace the ghost of a faded spark,\nWhispered hopes drowned beneath the dark,\nBreath held tight in restrained decree,\nBut I'm breaking free, can you feel me breathe?\n\nWhen they think you're dead, smile wide and freak 'em out,\nDance on the edge of shadows, scream what you're about,\nNumbness isn't peace, it's a quiet riot's shout,\nI kinda lived, in the spaces they forgot to count.\n\nAnd the night hums low with a restless beat,\nA pulse that drives through stubborn defeat,\nNot gone, not lost, just a flame that's vivid,\nI kinda lived, yeah, I kinda lived."
    },
    "5": {
      "title": "Smile for the Coroner",
      "hasLyrics": true,
      "lyrics": "Say cheese for the morgue, darling, flash that grin so wide\nCrack a joke with the reaper, playing dead with pride\nLipstick smeared like war paint on a face that never lied\nTick tock, the hollow clocks laugh, in the graveyard's uptown ride\n\nSmile for the coroner, show 'em all your best disguise\nTwisting pain into a carnival, where heartache's a sweet surprise\nMock your scars like jewelry, glitter tears in your eyes\nDance through your own funeral, where the jesters harmonize\n\nWhisper secrets to the shadows, tell the moon you're just fine\nHaunted halls and carnival calls, everyone's getting in line\nPaint your fears in broken hues, then laugh like it's a crime\nWhen they think you're gone forever, freak 'em out one last time\n\nSmile for the coroner, show 'em all your best disguise\nTwisting pain into a carnival, where heartache's a sweet surprise\nMock your scars like jewelry, glitter tears in your eyes\nDance through your own funeral, where the jesters harmonize\n\nClock hands spin like merry-go-rounds, hollow echoes fade to none\nIn your masquerade of misery, you're the puppet and the sun\nCrimson lips, a haunting grin, your dark parade just begun\nSmile for the coroner, darling, tonight you're still the one\n\nSmile for the coroner, show 'em all your best disguise\nTwisting pain into a carnival, where heartache's a sweet surprise\nMock your scars like jewelry, glitter tears in your eyes\nDance through your own funeral, where the jesters harmonize\nSmile wide, freak 'em out, the twisted fun never dies."
    },
    "6": {
      "title": "Trigger Discipline",
      "hasLyrics": true,
      "lyrics": "Fingertips on the steel, heartbeat in the drum,\nCould've let it loose, but I'm knowing what I become,\nWhispers in the shadows, breathing cold, numb silence,\nPower in my palm, but I'm choosing this defiance.\n\nTrigger finger twitchin', yeah, temptation's a beast,\nBut the strength ain't in the fire, it's the peace released,\nGrit in my veins, but restraint in my grip,\nEvery bullet held back's a victory equipped.\n\nWhat if I had pulled? What if the night turned red?\nCould've ended stories, but I tamed the beast instead,\nThe weight of what I didn't do, louder than a gun,\nPower's quiet mercy, battles lost and won.\n\nTrigger discipline, holdin' tight to what's right,\nNot the fight in the blaze but the calm in the night,\nCould've burned the block down, but I stayed cold steel,\nStrongest when I spared, that's the unspoken deal.\n\nWhispers turn to thunder, but my hands stay still,\nCould've fed the chaos but I mastered will,\nEvery breath a sermon, every pause a crown,\nStrength isn't how loud, it's when you don't shoot down.\n\nTrigger discipline, holdin' tight to what's right,\nNot the fight in the blaze but the calm in the night,\nCould've burned the block down, but I stayed cold steel,\nStrongest when I spared, that's the unspoken deal."
    },
    "7": {
      "title": "Quiet Like Bombs",
      "hasLyrics": true,
      "lyrics": "Silent in the daylight, like a shadow in the sun\nHolding in the thunder, waiting till it comes undone\nHeartbeat like a hammer, pounding under frozen veins\nFingers tracing firelines beneath a glassy, calm terrain\n\nSome people explode, burst like fireworks in the night\nOthers just wait, ticking bombs out of sight\nSheer pressure under the skin, building with every breath\nQuiet like bombs, hiding all the chaos underneath\n\nGlowing in the silence, like a storm that never breaks\nTension rising higher, every moment something shakes\nWords unspoken thunder, echo faster than the rain\nStillness is a battlefield, silent wars inside the frame\n\nSome people explode, burst like fireworks in the night\nOthers just wait, ticking bombs out of sight\nSheer pressure under the skin, building with every breath\nQuiet like bombs, hiding all the chaos underneath\n\nLet the bass drop heavy, let the strings pull me apart\nBeneath the calm surface, there's a wild beating heart\nBreaking all the borders, shattering the code within\nQuiet like bombs, waiting silently to win\n\nSome people explode, burst like fireworks in the night\nOthers just wait, ticking bombs out of sight\nSheer pressure under the skin, building with every breath\nQuiet like bombs, hiding all the chaos underneath\n\nQuiet like bombs, ready now to ignite\nQuiet like bombs, bursting into light"
    },
    "8": {
      "title": "Fake Resurrection",
      "hasLyrics": true,
      "lyrics": "Stepping out like I'm flawless, all eyes on the show\nMirror's talking, whispers every secret that I don't wanna know\nFlashing smiles conceal the void, dancing with my own disguise\nJust because you're walking doesn't mean you came back right\n\nDark clouds in my neon veins, shadows play a deadly game\nSeductive lies wrap tight around, fooling all who call my name\nI'm a ghost in designer skin, painless but I feel the crack\nBreathing in the afterglow, but can't rewind what breaks me back\n\nFake resurrection, I'm alive but it's just a masquerade\nHolding up these painted walls, every step a sharp cascade\nHeartbeats sync with the synth stab, layered voices calling me\nI wear the night like a crown, but inside there's no remedy\n\nCaught between the truth and stories I fabricate with ease\nEvery glance a silent scream, backstabbed by my own disease\nPretending's just an art form, and I'm master of the act\nDark, seductive lies keep people off my back\n\nFake resurrection, I'm alive but it's just a masquerade\nHolding up these painted walls, every step a sharp cascade\nHeartbeats sync with the synth stab, layered voices calling me\nI wear the night like a crown, but inside there's no remedy\n\nI'm breathing smoke and neon, dancing on the edge of decay\nA phantom in the bright lights, smiling while I fade away"
    },
    "9": {
      "title": "I Didn't Stay Dead",
      "hasLyrics": true,
      "lyrics": "You thought I was gone, just a shadow in the past\nFlickered out like light, like a moment that wouldn't last\nBut I'm louder now, breaking through your silence loud\nI didn't stay dead, no, I rose from beneath the crowd\n\nI stopped answering, turned my back on the noise\nLeft you in the dead zone, playing with broken toys\nBut I'm running wild, electric heart and wired lungs\nKicking down doors where fate's been holding the guns\n\nI didn't stay dead, I didn't fade away\nYou wrote off my colors, but I burn every shade\nI didn't stay dead, I'm alive in the scars\nA warrior's echo bouncing back to the stars\n\nScreaming out loud, drowning out the doubt\nI'm a storm in the calm you thought you could count\nYou wear your apathy like a second skin\nBut I'm the fire that you'll never win\n\nI didn't stay dead, I didn't fade away\nYou wrote off my colors, but I burn every shade\nI didn't stay dead, I'm alive in the scars\nA warrior's echo bouncing back to the stars\n\nClap your hands, feel the pulse inside this fight\nWe won't go quietly, we're burning through the night\nYou thought this was over, but I'm just getting sound\nI didn't stay dead, I'm the life you never found\n\nI didn't stay dead, I didn't fade away\nYou wrote off my colors, but I burn every shade\nI didn't stay dead, I'm alive in the scars\nA warrior's echo bouncing back to the stars"
    },
    "10": {
      "title": "Choke Chain Halo",
      "hasLyrics": true,
      "lyrics": "Tied up in silver threads, I used to fly\nHalo heavy 'round my neck, but it cuts too high\nMama said devotion's pure, but this is a cage\nEven angels snap their wings off when the chain's too tight, hey\n\nBurning love turns black, a twisted fate\nHearts collide in holy war, trapped in weight\nThis poison kissed with golden light, I'm fading fast\nCaught between the savior and the outcast\n\nChoke chain halo, crushing my soul\nBound in loyalty but losing control\nDevotion's a leash with barbs so cold\nIn this dance of angels, I'm sold and I'm bold\n\nI prayed for grace, but found a war inside\nMix of faith and fury, nowhere to hide\nEvery promise a shackle, every vow a fight\nSaints and sinners wear the same fading light\n\nRaise your hands, but they pull you down\nSacred and savage, lost and found\nTwisted love, a blade that bites\nCaught in the bloodlines of endless night\n\nChoke chain halo, crushing my soul\nBound in loyalty but losing control\nDevotion's a leash with barbs so cold\nIn this dance of angels, I'm sold and I'm bold\n\nEven wings that soar will bleed when they're tied\nIn the war of hearts, there's no place to run and hide\nKill the faith that suffocates, break the chain and fly\nBurn the halo down, watch it ignite the sky\n\nChoke chain halo, crushing my soul\nBound in loyalty but losing control\nDevotion's a leash with barbs so cold\nIn this dance of angels, I'm sold and I'm bold\n\nChoke chain halo, I'm breaking free\nLost in the fire, reclaiming me\nDevotion turned venom, now I see\nEven angels fall but they rise endlessly"
    },
    "11": {
      "title": "Last Time I Felt Clean",
      "hasLyrics": true,
      "lyrics": "Fingers trace the edge of glass,\nThe quiet hum before the crash,\nSky folded thin like old regrets,\nLast time I felt clean—don't forget.\n\nA silence thicker than the night,\nYour shadow flickers in the light,\nHeartbeat syncing out of time,\nDancing on the razor's line.\n\nLast time I felt clean, under neon moons,\nWhere whispers turned into tunes,\nThe air was soft, electric, unseen—\nThat moment before everything changed, last time I felt clean.\n\nGlass shatters slow, but you don't hear,\nThe calm before the storm draws near,\nA breath held in a fragile thread,\nWords we never got to have said.\n\nFloating in a world too loud,\nChasing ghosts inside the clouds,\nBut in that quiet, deep and keen,\nI found the last time I felt clean.\n\nLast time I felt clean, under neon moons,\nWhere whispers turned into tunes,\nThe air was soft, electric, unseen—\nThat moment before everything changed, last time I felt clean."
    },
    "12": {
      "title": "Echo of a Threat",
      "hasLyrics": true,
      "lyrics": "Shadows scrape the walls inside my head\nSilent screams I never said\nFootsteps pulse beneath my skin\nHeartbeat racing, can't begin\n\nSometimes the danger's gone,\nBut my body doesn't believe it\nWhispers crawl beneath my bone\nEchoes twisting, can't relieve it\n\nEyes wide in the empty dark\nEvery breath ignites a spark\nParanoia claws the night\nDancing in the edge of light\n\nSometimes the danger's gone,\nBut my body doesn't believe it\nWhispers crawl beneath my bone\nEchoes twisting, can't relieve it\n\nBreathe in fear like it's the air\nHaunted by what's never there\nCaught between the past and now\nTense and raw, I don't know how\n\nSometimes the danger's gone,\nBut my body doesn't believe it\nWhispers crawl beneath my bone\nEchoes twisting, can't relieve it\n\nSometimes the danger's gone,\nBut my body doesn't believe it\nParanoia leads the dance\nIn a breathless, haunted trance"
    },
    "13": {
      "title": "Burn the Receipt",
      "hasLyrics": true,
      "lyrics": "No witness in the ashes, no paper trail to find\nYou made your bed of lies, now I'm out of time\nBurn the receipt, watch the past go up in flames\nNo looking back, I'm done with your twisted games\n\nYou don't get a second shot, no rewind this show\nNo proof, no alibi, but baby, you know\nI'm the shadow in your mirror, the weight you can't shed\nNo apologies, no takebacks, just the words left unsaid\n\nBurn the receipt, burn the receipt\nNo evidence, just the heat beneath my feet\nBurn the receipt, burn the receipt\nRevenge tastes sweet, now I'm finally free\n\nYou thought I'd fold, drown in your regret\nBut I'm the storm you never saw, a fire in silhouette\nI'm spinning out your guilt, throwing it to the floor\nNo chains, no binds, not your fool anymore\n\nYou don't need proof, you know what you did\nThe silence is louder than any thing you hid\nNo remorse, no fear, just the thrill of the fight\nI'm reclaiming my power under neon lights\n\nBurn the receipt, burn the receipt\nNo evidence, just the heat beneath my feet\nBurn the receipt, burn the receipt\nRevenge tastes sweet, now I'm finally free\n\nFlip the script, take the pain, let it scatter like smoke\nI'm the ember you can't choke, the fire you provoked\nNo apologies, no takebacks, I'm done with your disease\nBurn the receipt, set it loose, watch it burn with ease\n\nBurn the receipt, burn the receipt\nNo evidence, just the heat beneath my feet\nBurn the receipt, burn the receipt\nRevenge tastes sweet, now I'm finally free"
    }
  }
}