{
 "albumId": "ForgeOfFire",
 "albumTitle": "Forge of Fire",
 "tracks": {
   "1": {
     "title": "Forge of Fire",
     "hasLyrics": true,
     "lyrics": "Heat's rising, sparks are flying, come and see what I've made,\nSteel and flame twist and turn, in the dance that never fades.\nIron whispers tales of power beneath the hammer's call,\nFrom my fire, legends born, standing proud and standing tall.\n\nIn the forge of fire, where the wild flames play,\nI shape the night, I craft the day.\nBlazing trails in a crimson sky,\nBrokkr's fire will never die.\n\nMolten rivers flow like song, pouring out in shining streams,\nEvery strike a pulse of life, every glow a thousand dreams.\nFrom the core, a shining blade, fierce and true it gleams so bright,\nMy finest work, a fiery heart, born in roaring, molten light.\n\nIn the forge of fire, where the wild flames play,\nI shape the night, I craft the day.\nBlazing trails in a crimson sky,\nBrokkr's fire will never die.\n\nAll the metal, all the heat, every spark a drumbeat strong,\nEchoes in the valley deep, legends forged to carry on.\nWatch the embers glow and dance, feel the power in the air,\nBrokkr's forge will shape the world with its blazing flare.\n\nIn the forge of fire, where the wild flames play,\nI shape the night, I craft the day.\nBlazing trails in a crimson sky,\nBrokkr's fire will never die."
   },
   "2": {
     "title": "The God Seed",
     "hasLyrics": true,
     "lyrics": "Across the forge where fire sings,\nBrokkr hammers threads of myth and wings,\nOdin's call, the Allfather's plea,\nTo craft a seed that breaks the freeze.\n\nNine realms shiver in shadow's clutch,\nA dying light, the gods' last touch,\nFrom embers born in iron's heart,\nThe God Seed waits to start its spark.\n\nRide the rhythm of the forge's beat,\nSteel and soul collide and meet,\nIn every spark, a universe born,\nA godly seed to weather the storm.\n\nThe God Seed grows, a blazing flame,\nThrough frost and storm, it stakes its claim,\nIn Brokkr's hands, the future's made,\nA fiery hope that won't degrade.\n\nHammer strikes a thunderous song,\nWhere legends clash and right the wrong,\nOdin watches, eyes like flame,\nThe seasons turn won't be the same.\n\nThe Nine Realms dance on fragile thread,\nNow armored strong and heaven-bred,\nFrom mortal coil to divine creed,\nRuns the power of the God Seed.\n\nRide the rhythm of the forge's beat,\nSteel and soul collide and meet,\nIn every spark, a universe born,\nA godly seed to weather the storm.\n\nHammer strikes a thunderous song,\nWhere legends clash and right the wrong,\nOdin smiles, the night concedes,\nSalvation rides on the God Seed."
   },
   "3": {
     "title": "Phoenix Roots",
     "hasLyrics": true,
     "lyrics": "I was caught in flames that burned so high\nMuspelheim's fire held me tight\nChains of fire giants tried to break my spine\nBut I've been tempered, forged in light\n\nThrough the smoke, I slowly rose again\nRoots dug deep where the cold winds moan\nSvartalfheim's shadows fed my soul\nA seed of steel in the dark, full-grown\n\nFrom the ashes, I found my truth\nBrokkr's fire is born anew\nMaster of the Forge, with hands that bleed\nI shape the world from broken dreams\n\nThe Great Withering tried to steal the earth\nBut seeds survived in secret ground\nNine Realms connected underfoot\nIn silent roots, my strength is found\n\nI was broken, but now I'm whole\nTough as iron, heart like gold\nSuffering carved the man I am\nA phoenix burning out the cold\n\nFrom the ashes, I found my truth\nBrokkr's fire is born anew\nMaster of the Forge, with hands that bleed\nI shape the world from broken dreams\n\nI rise again, no chains can hold\nIn every spark, my story's told\nThrough fire and earth, I claim my name\nBrokkr lives, reborn in flame"
   },
   "4": {
     "title": "Realm Walker",
     "hasLyrics": true,
     "lyrics": "Across the stars, the forge ignites, a spark that breaks the endless night\nBrokkr's hands, they shape the light, crafting dreams with fire bright\nFrom realm to realm, the hammer rings, echoing through endless skies\nCarving hope on wings of flame, where every shadow dies\n\nThrough endless doors, he rides the storm, weaving tales of ancient art\nBringing life to frozen plains, igniting every heart\nWith seeds of craft in every land, he sows the fire of change\nNine Realms rise beneath his touch, a symphony rearranged\n\nWe are the flames that lift the night\nWe are the keepers of the light\nWith every step, the darkness falls\nBrokkr's call, it breaks the walls\nRaise your hands and hear the sound\nJoy and hope, they spread around\nFrom distant shores to skies unknown\nIn every heart, he's never alone\n\nIn Midgard's fields, the laughter grows, children dance through golden waves\nIn Alfheim's halls, the magic flows, alive where sunlight paves\nIn Svartalf's smithies, sparks take flight, the craftsman's song rebounds\nEvery bond a masterpiece, where friendship knows no bounds\n\nHe teaches strength without the sword, a legacy refined\nUniting realms with every chord, a harmony aligned\nFrom ocean depths to mountain peaks, the song forever soars\nBrokkr's hand, a guiding light, in every open door\n\nWe are the flames that lift the night\nWe are the keepers of the light\nWith every step, the darkness falls\nBrokkr's call, it breaks the walls\nRaise your hands and hear the sound\nJoy and hope, they spread around\nFrom distant shores to skies unknown\nIn every heart, he's never alone\n\nOnward now, the journey calls, the anthem strong and bold\nWith every soul that hears this song, a story new, retold\nThe realms unite beneath the sky, their futures bright and clear\nBrokkr walks, the world ignites — the dawn is finally here\n\nWe are the flames that lift the night\nWe are the keepers of the light\nWith every step, the darkness falls\nBrokkr's call, it breaks the walls\nRaise your hands and hear the sound\nJoy and hope, they spread around\nFrom distant shores to skies unknown\nIn every heart, he's never alone"
   },
   "5": {
     "title": "Storm the Realms",
     "hasLyrics": true,
     "lyrics": "From the embers of the forge, a spark ignites the night\nBrokkr's hands, they shape the dawn, crafting dreams in flight\nThrough the wilds of Muspelheim, across the frost and flame\nHe's the seed in every soil, lighting up the game\n\nWith every realm he crosses, the network grows so wide\nGrowers rise and stand beside, under twilight skies\nThe Forge Council's voice expands, a beacon through the haze\nSowing strength in fractured lands, igniting ancient ways\n\nStorm the realms, break the chains, let the harvest roar\nFrom roots to stars, we rise and soar\nBrokkr's craft, the legacy, forevermore\nStorm the realms, break the chains, open every door\n\nAdapting green to fire and snow, to oceans deep and wide\nLessons learned in every storm, the craft will not subside\nFrom Jotunheim's towering peaks to Vanaheim's lush embrace\nSeeds of change take hold and bloom, rewriting every place\n\nBridging worlds with every grain, the lines begin to fade\nConnections born in fertile ground, a new alliance made\nTransformed are lands once torn apart, united by the hand\nOf Brokkr's flame, a guiding light, across the Nine Realms' strand\n\nStorm the realms, break the chains, let the harvest roar\nFrom roots to stars, we rise and soar\nBrokkr's craft, the legacy, forevermore\nStorm the realms, break the chains, open every door\n\nHear the anthem in the wind, feel the rising tide\nA chorus forged in fire and hope, where hearts collide\nThis is more than just a seed, it's a revolution free\nBrokkr leads the way ahead, a timeless symphony\n\nStorm the realms, break the chains, let the harvest roar\nFrom roots to stars, we rise and soar\nBrokkr's craft, the legacy, forevermore\nStorm the realms, break the chains, open every door"
   },
   "6": {
     "title": "Crystal Gardens",
     "hasLyrics": true,
     "lyrics": "In the stillness where the light begins to play\nBrokkr's hands craft worlds in a tender way\nGlass and crystal frame the green and gold,\nA dance of life in chambers so bold\n\nColors shimmer, whispers hum with glow\nRoots entwined in luminescent flow\nEvery leaf a story etched in light\nA sanctuary born of day and night\n\nRaise your eyes, see the miracle grow\nBeneath the stars, where the wild winds blow\nCrystal gardens reach for the sky,\nGuardians of dreams that never die\n\nStep inside, breathe the endless dawn\nMagic woven where hope is drawn\nHere the earth meets the shining stone,\nA kingdom of wonder, built to own\n\nFeel the pulse of creation's heart\nEvery vein a masterpiece, every branch a start\nIn this prism world we stand inspired,\nBreathing the future, forever inspired\n\nRaise your eyes, see the miracle grow\nBeneath the stars, where the wild winds blow\nCrystal gardens reach for the sky,\nGuardians of dreams that never die\n\nOh, the world ignites beneath your gaze\nIn Brokkr's halls, the light never fades\nWe are the keepers, the spark, the flame,\nHolding the wonder, calling its name\n\nRaise your eyes, see the miracle grow\nBeneath the stars, where the wild winds blow\nCrystal gardens reach for the sky,\nGuardians of dreams that never die\n\nShine on, shine on through the endless night\nIn the crystal gardens, we take flight\nTogether we rise, together we claim,\nThe beauty of life, the power of flame."
   },
   "7": {
     "title": "Runic Ink",
     "hasLyrics": true,
     "lyrics": "Runic ink drip, glowin' like a fire strike\nTattoo tales from the forge, yeah, Brokkr's life on the mic\nSvartalfheim minerals, mix it in the vein\nEvery line a saga, gotta feel the pain\n\nSkin a map of Nine Realms, circuits intertwine\nSeedcraft network buzzin', power in every sign\nNew ink, new story, yeah, the saga's live\nFrom trials to triumphs, watch the legends rise\n\nLights flash, crowd roar, feel the pulse in my skin\nRunes hum ancient spells, magic locked within\nMy arms bleed history, every mark designed\nInk talks louder than words, chronicles aligned\n\nRunic ink lightin' up the night, can't hide it\nAll these stories on my skin, watch me ride it\nFrom forge trials to realm ties, we unite it\nLiving legends in my veins, yeah, this ink ignites it\n\nFast hi-hats, heavy 808s, bring the heat alive\nRock chords grind, pop-punk spark, got me feeling high\nThis skin's a living album, every mark a vibe\nBrokkr's tale in technicolor, can't deny the drive\n\nRunic script glow, ancient script, stories old\nPower seeping through, watch that saga unfold\nEvery scratch a memory, every symbol bold\nInk infused with magic, breaking every mold\n\nRunic ink lightin' up the night, can't hide it\nAll these stories on my skin, watch me ride it\nFrom forge trials to realm ties, we unite it\nLiving legends in my veins, yeah, this ink ignites it\n\nChampagne sizzling, bass drops, we celebrate\nBrokkr's ink tell the tales that time won't break\nFrom hammer to skin, a myth we create\nLiving proof in the ink, this is fate we make\n\nRunic ink lightin' up the night, can't hide it\nAll these stories on my skin, watch me ride it\nFrom forge trials to realm ties, we unite it\nLiving legends in my veins, yeah, this ink ignites it"
   },
   "8": {
     "title": "Master's Apprentice",
     "hasLyrics": true,
     "lyrics": "Woke up with the sunrise in a new sky,\nHammer in my hand and the stars in my eyes,\nTraveling the realms where the stories unfold,\nSpinning gold from the silver, tales to be told.\n\nI meet young hearts with dreams on their sleeves,\nShaping future skies from the roots of old trees,\nTheir sparks light the dark, watch them rise and fly,\nEvery nail that they drive, I feel proud inside.\n\nMaster's apprentice, but the circle's wide,\nPassing on the flame that never dies,\nJoy in the teaching, hope in the hands,\nLegacy grows like the finest plans.\n\nSee them forge a path I never dreamed,\nCrafting magic deeper than it seems,\nI'm just the whisper in their fire's beat,\nThey'll build a world from the seeds we seed.\n\nFrom village fires to the far-flung stars,\nOur songs echo on, no matter how far,\nBreaking chains, lighting skies anew,\nThe craft and the heart, bound through and through.\n\nMaster's apprentice, but the circle's wide,\nPassing on the flame that never dies,\nJoy in the teaching, hope in the hands,\nLegacy grows like the finest plans.\n\nSo carry on, young soul, with your glowing art,\nEvery lesson a bridge, every dream a start,\nI'll be there in the shadow of your bright sun,\nMaster's apprentice — the journey's just begun."
   },
   "9": {
     "title": "Brothers of the Flame",
     "hasLyrics": true,
     "lyrics": "Through fire and ash, we carved our names,\nBrothers bound in broken chains.\nEddan's laugh like rolling thunder,\nLongtree stands while storm-clouds sunder.\n\nRaise the hammer, strike the anvil bright,\nForge our story through the night.\nCrowned in sparks with fists aflame,\nWe ride the winds, brothers of the flame.\n\nOh, oh, oh, the bonds we claim,\nTogether strong, brothers of the flame.\nHand in hand, through storm and rain,\nOur hearts ignite, brothers of the flame.\n\nIn every clash, through every fight,\nCouncil sworn beneath the starry light.\nLift your voices, sing it loud,\nWe stand unbroken, fierce, and proud.\n\nWith every trial, the fire grew,\nLoyal hearts both bold and true.\nFrom distant realms our laughter calls,\nNo shadow deep, no mountain tall.\n\nOh, oh, oh, the bonds we claim,\nTogether strong, brothers of the flame.\nHand in hand, through storm and rain,\nOur hearts ignite, brothers of the flame.\n\nStomp the ground, the rhythm rolls,\nFiddle cries and spirit soars.\nBy the campfire's glowing light,\nWe share our tales, united might.\n\nEddan, Longtree, forge and song,\nSide by side, we all belong.\nIn the blaze where friendships grow,\nOur courage burns and rivers flow.\n\nOh, oh, oh, the bonds we claim,\nTogether strong, brothers of the flame.\nHand in hand, through storm and rain,\nOur hearts ignite, brothers of the flame.\n\nRaise the hammer, strike the anvil bright,\nForge our story through the night.\nCrowned in sparks with fists aflame,\nWe ride the winds, brothers of the flame."
   },
   "10": {
     "title": "Genetic Warrior",
     "hasLyrics": true,
     "lyrics": "Hammer strikes the twisted helix, shatter every chain\nRunes bleed fire, scorched in blood, defy the mortal bane\nNine Realms pulse beneath my forge, molten veins ignite\nWelding sacred strands of war, in Odin's iron light\n\nCraft the warrior's DNA, bloodlines born in flame\nFury forged in hammer's wrath—no outlaw dares defame\nSacred seed vault sealed by gods, Loki's lies repelled\nEvery strike a war cry screamed, in lightning's deafening knell\n\nGenetic warrior spawn! Defend the throne of fate!\nBrokkr's art—a holy rage they all devour and hate\nMock my craft, feel thunder crash! Break your feeble lies!\nIron blood, ancient code—reborn as Odin's prize\n\nRunes carve destiny's design, I hammer truth unbound\nSculpting gods in mortal form, the eternal battleground\nEyes of frost, breath of flame, DNA entwined\nBrokkr's wrath in every pulse, divine by Odin signed\n\nBetrayal's venom spins its web, Loki claws and schemes\nBut I'm the sentinel of flesh, the forge that fuels their dreams\nDoubt my god-tier inbred bond, taste the hammer's sting\nEach chain I break, each life I make, let battle's anthem ring\n\nGenetic warrior spawn! Defend the throne of fate!\nBrokkr's art—a holy rage they all devour and hate\nMock my craft, feel thunder crash! Break your feeble lies!\nIron blood, ancient code—reborn as Odin's prize\n\nChaos roar, tongues of fire, pulse in staccato strike\nSyncopated death and life, creation's perfect spike\nBlood and rune, steel and pain, pulse of polyrhythmic war\nBrokkr's hammer, god of craft—unleash the sacred roar!\n\nGenetic warrior spawn! Defend the throne of fate!\nBrokkr's art—a holy rage they all devour and hate\nMock my craft, feel thunder crash! Break your feeble lies!\nIron blood, ancient code—reborn as Odin's prize!"
   },
   "11": {
     "title": "Inked",
     "hasLyrics": true,
     "lyrics": "In the shadows of the forge, where the nine realms meet,\nBrokkr's hands shape the spark, fireweed's burning heat.\nSeeds of flame and leaf, in his palm they spin,\nCrafted with a rhythm that begins deep within.\n\nInk winds like rivers, tales mark his skin,\nDragons, stars, and forests—stories woven in.\nEvery line a legend, every shade a fight,\nA living map of wisdom, drawn in black and white.\n\nRise from embers, rise from ash,\nBrokkr's art will always last.\nInked in fire, strong and bold,\nA tale of craft forever told.\n\nShrooms like strands of twilight, wisdom seeds in bloom,\nClarity for gods who wander through the cosmic gloom.\nHis fingertips, the architects of realms untold,\nIn every drop of sweat, a secret art unfolds.\n\nTattoos dance like lightning, flicker in the night,\nMarks of courage flashing under forge's light.\nIn his skin, a story carved with passion's sword,\nA symphony of power, every scar adored.\n\nRise from embers, rise from ash,\nBrokkr's art will always last.\nInked in fire, strong and bold,\nA tale of craft forever told.\n\nFrom head to toe, the ink proclaims his lore,\nCraftsman of the gods, and so much more.\nHe's the fire and the seed, the shroom's whispered call,\nIn every line a warrior, standing proud and tall.\n\nRise from embers, rise from ash,\nBrokkr's art will always last.\nInked in fire, strong and bold,\nA tale of craft forever told."
   },
   "12": {
     "title": "Forge Council Rising",
     "hasLyrics": true,
     "lyrics": "Raise your hands, the hammer's coming down\nBuild the fire, we're laying sacred ground\nBrothers bound by sweat and stone\nSeedcraft's rhythm beating in our bones\n\nNine principles carved in flame\nNot for glory, not for name\nA legacy not chained but freed\nBrokkr's dream is ours to breed\n\nForge Council rising, hear the call\nMaster growers, one and all\nPassing torch from hand to hand\nTogether strong, we take this stand\n\nHands worn rough from honest work\nTeach the young, don't let it shirk\nSecrets shared, they sharpen steel\nThe power's in what we reveal\n\nNo lone kings with hidden scrolls\nWe build a fortress made of souls\nIn every seed, in every leaf\nOur brotherhood is our belief\n\nForge Council rising, hear the call\nMaster growers, one and all\nPassing torch from hand to hand\nTogether strong, we take this stand\n\nThe fire burns in heart and mind\nLegacy we forge entwined\nBrothers in the night, we keep the flame\nIn this council, we stake our claim\n\nForge Council rising, hear the call\nMaster growers, one and all\nPassing torch from hand to hand\nTogether strong, we make our stand\n\nTogether strong, we make our stand"
   },
   "13": {
     "title": "Odin",
     "hasLyrics": true,
     "lyrics": "[Instrumental]"
   }
 }
}