{
  "albumId": "Ghosts",
  "albumTitle": "Ghosts",
  "tracks": {
    "1": {
      "title": "Finding Her",
      "hasLyrics": true,
      "lyrics": "In the flicker of a candle flame, she spoke without a lie  
				Words like thunder in a quiet room, a storm behind her eyes  
				I saw the fire that matched my own, the spark of something rare  
				A mind that danced through shadows deep, a soul beyond compare  

				She understands me like no one ever will, a ghost inside my skin  
				In her arms, the world would bend and break, but still, we'd rise again  
				Plans we sketched on midnight dreams, futures painted bright  
				Then dawn pulled curtains hard and cold—alone, I lost the light  

				Her laughter echoed in my veins, a symphony unsung  
				Sharp wit like blades of tempered steel, a battle just begun  
				She held my scars like sacred text, reading every line  
				A fortress built on fragile hope, a refuge by design  

				She understands me like no one ever will, a ghost inside my skin  
				In her arms, the world would bend and break, but still, we'd rise again  
				Plans we sketched on midnight dreams, futures painted bright  
				Then dawn pulled curtains hard and cold—alone, I lost the light  

				Now morning bleeds through broken glass, and silence fills the room  
				The castle crumbled overnight, beneath a haunted moon  
				Memories like shattered shards, futures turned to ash  
				A perfect moment lost to time, fading fast  

				She understands me like no one ever will, a ghost inside my skin  
				In her arms, the world would bend and break, but still, we'd rise again  
				Plans we sketched on midnight dreams, futures painted bright  
				Then dawn pulled curtains hard and cold—alone, I lost the light  

				Alone forever broken, the echo in the dark  
				Searching for the shadow of a flame that caught my heart."
    },
    "2": {
      "title": "Vanished At Dawns Light",
      "hasLyrics": true,
      "lyrics": "We said goodnight beneath the silver sky  
				Her eyes were flames, a spark that couldn't die  
				But morning broke with shadows cold and deep  
				I saw her wake, then silence made me weep  

				Vanished at dawn's light, she slipped through air  
				No words to bind her, like a ghost laid bare  
				I never saw her leave, no trace, no fight  
				Just emptiness consuming all my night  

				I woke expecting warmth beside my skin  
				But found a void where love had once been  
				She’s gone as a bird on the feather’s glide  
				A whispered secret carried on the tide  

				I am left, I am here, hollow and torn  
				Desire drowned in sorrow, endlessly worn  
				For every day and tomorrows that never come  
				An echo of a heartbeat, forever undone  

				The world turned gray where colors used to blaze  
				Memories bleed in this endless haze  
				Her silence haunts like a sharpened knife  
				Vanished at dawn, she stole my life  

				I am left, I am here, shadows my own  
				No flame inside, just a chilled, hollow stone  
				For every day and tomorrows that never come  
				A whispered lament for love undone"
    },
    "3": {
      "title": "Was She Real",
      "hasLyrics": true,
      "lyrics": "In the shadowed dawn of whispered glance,  
				Two souls collide in fleeting dance,  
				Electric touch, a spark so bright,  
				A flicker lost in endless night.  

				Eyes that spoke what lips denied,  
				Silent vows where fears reside,  
				A tangled maze of want and feel,  
				But was she real, was she real?  

				Was she real? Or just a ghost I chased,  
				Phantom dreams that time erased?  
				Did I paint a face with colors blurred,  
				Or hold a ghost that never stirred?  

				Fantasies that breathe and break,  
				Walking earth, then vanish, take  
				A secret slink without a word—  
				Was she real? Was she real?  

				Moment’s fire, a sudden flame,  
				Passion’s echo without a name,  
				Vanished whispers swept away,  
				Leaving ruins where hearts once lay.  

				Was she real or just a sigh,  
				A whispered truth behind my eyes?  
				Did I see what I desired,  
				Or build a world from ashes fired?  

				Was she real? Or just a ghost I chased,  
				Phantom dreams that time erased?  
				Did I paint a face with colors blurred,  
				Or hold a ghost that never stirred?  

				Fantasies that breathe and break,  
				Walking earth, then vanish, take  
				A secret slink without a word—  
				Was she real? Was she real?"
    },
    "4": {
      "title": "Destiny Denied",
      "hasLyrics": true,
      "lyrics": "We traced the sparks beneath the silver moon  
				Whispers tangled in a fragile tune  
				Eyes held secrets only we could know  
				A promise blooming where wild rivers flow  

				Dreams painted vivid in the dark  
				Hands that reached to leave a mark  
				Every breath was a dawn anew  
				A future forged for me and you  

				But silence broke the fragile tide  
				A curtain fallen, hearts untied  
				Threads once wound, now torn and fried  
				Hope crumbles when destiny’s denied  

				The mornings echoed with your name  
				Fading footprints in the rain  
				A sudden chill, a fading light  
				Two souls lost in endless night  

				Yet still I trace the ghost of you  
				In every shade, in every hue  
				A bond that time refused to hide  
				A love that time itself denied  

				But silence broke the fragile tide  
				A curtain fallen, hearts untied  
				Threads once wound, now torn and fried  
				Hope crumbles when destiny’s denied  

				Threads once wound, now torn and fried  
				Hope crumbles when destiny’s denied"
    },
    "5": {
      "title": "Faded Soul",
      "hasLyrics": true,
	  "lyrics": "Shadows fall where light once burned  
				Whispers fade, no words returned  
				A spark ignited, sudden glow  
				Now drowning deep in undertow  

				Promises like ashes blown  
				Fragments lost, seeds never sown  
				Eyes that once held skies of blue  
				Turned to dusk, and no adieu  

				Faded soul, you slip away  
				Haunting nights, a ghostly sway  
				Silent echoes haunt the night  
				Love undone, without a fight  

				Threads we wove now torn apart  
				Echoes echo in my heart  
				Flicker still, a fading flame  
				Calling out, but calling vain  

				Faded soul, you slip away  
				Haunting nights, a ghostly sway  
				Silent echoes haunt the night  
				Love undone, without a fight  

				Faded soul, forever gone  
				Left me here to carry on  
				Winds of sorrow softly roll  
				In the wake of a faded soul"
    },
    "6": {
      "title": "Shattered World",
      "hasLyrics": true,
      "lyrics": "My world is upside down and inside out  
				A fragile spark ignites, then fades to doubt  
				I fell hard, deep and fast through cracks unseen  
				A love untamed, dissolving in between  

				We whispered dreams beneath a silver sky  
				But dawn betrayed the promises, goodbye  
				Said goodnight but I never got to good morning  
				Leaves of hope torn by fate’s cruel warning  

				Shattered world, where new love dies in haste  
				Echoes linger in a hollowed place  
				A fragile bloom caught in the storm’s cruel hand  
				Slipping slowly through the shifting sand  

				Silent shadows dance where light once stayed  
				Fragments of a heart that time betrayed  
				I reach for you in memories’ embrace  
				The warmth fades, leaving just an empty space  

				We whispered dreams beneath a silver sky  
				But dawn betrayed the promises, goodbye  
				Said goodnight but I never got to good morning  
				Leaves of hope torn by fate’s cruel warning  

				Shattered world, where new love dies in haste  
				Echoes linger in a hollowed place  
				A fragile bloom caught in the storm’s cruel hand  
				Slipping slowly through the shifting sand  

				The past, a ghost that haunts my restless mind  
				Love’s cruel theft, forever unkind  
				In this shattered world, I stand alone  
				A heart of glass, forever prone"
    },
    "7": {
      "title": "Can They Ever",
      "hasLyrics": true,
      "lyrics": "Who’s gonna hold me when the night gets cold?  
				When the truth I wear is all I’ve ever sold,  
				Can they see past cracks that never heal?  
				Or am I just asking for a love that’s never real?  

				Can they ever love me for the scars I hide,  
				For the quiet wars I fight inside?  
				Will they stay when the silence grows?  
				Or turn away, leaving a heart no one knows?  

				I’ve walked through shadows, worn my skin so thin,  
				Trying to find the place where I could fit in.  
				But every smile feels like a fragile cage,  
				And I’m haunted by the question of another page.  

				Can they ever love me for the scars I hide,  
				For the quiet wars I fight inside?  
				Will they stay when the silence grows?  
				Or turn away, leaving a heart no one knows?  

				Maybe it’s too late to be the one they choose,  
				But still, I wonder if I’ll ever lose  
				The fear that love is just a fleeting ghost,  
				And that I’m always the one who loves the most.  

				Can they ever, can they ever, can they ever love me?  
				Or am I just a shadow they can't see?  
				Can they ever, can they ever, will they ever stay?  
				Or am I fading out, slipping away?"
    },
    "8": {
      "title": "Endless Hope",
      "hasLyrics": true,
      "lyrics": "Flicker on the screen, your face in midnight glow  
				Words that shaped a world where only we could go  
				Pixels pinned our hearts in fragile, quiet streams  
				Echoes in the silence, haunting all my dreams  

				I trace the lines you wrote, the stories still alive  
				Though shadows claim your voice, I swear you never died  
				A love born in the wires, deeper every night  
				Promise on the horizon, chasing fading light  

				Endless hope, it lingers like a fire never gone  
				Through the dark and distance, I still hold on  
				Though you're gone, I feel you near,  
				In every whispered word, in every tear  
				Endless hope, I’ll keep it burning strong  

				Remembering the laughter, the moments we designed  
				A future carved in stardust, in places undefined  
				You slipped beyond the skyline, lost inside the frame  
				But I keep your flame alive, calling out your name  

				I’ll wait across the miles, where time can’t break the chain  
				In every silent echo, our hearts will meet again  
				No goodbye can silence what the soul once spoke  
				In this endless hope, you’re the fuel I cloak  

				Endless hope, it lingers like a fire never gone  
				Through the dark and distance, I still hold on  
				Though you're gone, I feel you near,  
				In every whispered word, in every tear  
				Endless hope, I’ll keep it burning strong  

				And when the dawn returns, and breaks this lonely night  
				I believe you’ll find your way back into light  
				Until then, I’m waiting, in dreams you’re always close  
				With endless hope, the love I cherish most  

				Endless hope, forever in my veins  
				A spark reborn through the trailing rains  
				Though you're gone, you’re all I know,  
				In every beat, I’ll never let go  
				Endless hope, forever burning strong."
    },
    "9": {
      "title": "Taking Chances",
      "hasLyrics": true,
      "lyrics": "Woke to dreams painted in your eyes,  
				Fingers tracing secrets under skies,  
				Every moment’s a spark in the night,  
				A last kiss falling soft in fading light.  

				Holding tight to whispers we share,  
				A path unwinding, a breath of fresh air,  
				Not afraid to leap into the unknown,  
				With you, I’m finally feeling at home.  

				Taking chances on this new love,  
				Like stars that shine from up above,  
				I see a future on that golden pond,  
				Together, where our hearts belong.  

				Morning breaks with your hand in mine,  
				Two souls dancing outside of time,  
				Every heartbeat louder and clear,  
				That kind of love that’s so dear.  

				I won’t give up on what’s in sight,  
				Even when shadows blur the night,  
				Your smile lights the way, so near,  
				The courage grows to hold you here.  

				Taking chances on this new love,  
				Like stars that shine from up above,  
				I see a future on that golden pond,  
				Together, where our hearts belong.  

				In every breath, in every glance,  
				We’re writing a story of chance,  
				No fear, just hope, forever near,  
				A love that’s true and crystal clear.  

				Taking chances on this new love,  
				Like stars that shine from up above,  
				I see a future on that golden pond,  
				Together, where our hearts belong."
    },
    "10": {
      "title": "Nothing Compares",
      "hasLyrics": true,
      "lyrics": "In the quiet of the morning light,  
				I see every line, every smile so right,  
				No shadow dims the way you shine,  
				Every little flaw feels like a sign.  

				The world could offer all it has,  
				But none of it would fill my glass,  
				For in your eyes, the truth is clear,  
				Nothing compares when you’re near.  

				Nothing compares, nothing even dares,  
				To the way you hold me, the way you care,  
				Every quirk’s a treasure, every laugh’s a prayer,  
				Love like this is beyond all compare.  

				A crooked grin, a freckle’s place,  
				Every imperfect, perfect trace,  
				In every breath, in every stare,  
				You’re the only one beyond compare.  

				Let the stars fall and time pretend,  
				No exchange could ever contend,  
				’Cause in your arms, my heart’s aware,  
				Nothing compares, my love is there.  

				Nothing compares, nothing even dares,  
				To the way you hold me, the way you care,  
				Every quirk’s a treasure, every laugh’s a prayer,  
				Love like this is beyond all compare."
    },
    "11": {
      "title": "Tried Not To",
      "hasLyrics": true,
      "lyrics": "I tried not to run, I tried not to get scared,  
				I tried not to feel the way you made me care,  
				Kept my heart in shadows, tried to stay unclear,  
				But your fire caught me, now I’m standing here.  

				I found your love burns so bright,  
				Your light shines with might,  
				Now I am running back,  
				To where everything’s right.  

				Whispers in the dark, traces of your name,  
				Every step I take, I’m falling just the same,  
				Tried to walk away, but chains pulled me close,  
				In the heat of your smile, I’m lost in your ghost.  

				I found your love burns so bright,  
				Your light shines with might,  
				Now I am running back,  
				In your arms all through the night.  

				No more hiding, no more disguise,  
				I’ve opened my heart, no more goodbyes,  
				You’re the song I breathe, the air I need,  
				In your love’s embrace, I’m finally freed.  

				I found your love burns so bright,  
				Your light shines with might,  
				Now I am running back,  
				Where our two souls ignite."
    },
    "12": {
      "title": "Sleepless Days",
      "hasLyrics": true,
      "lyrics": "What do I do with myself tonight  
				When the only star’s gone out of sight  
				You vanished like a ghost at dawn  
				And I’m left here trying to carry on  

				Can I go on, can I break the spell  
				Or am I caught inside this empty shell?  
				I’m wide awake, but I feel so gone  
				Counting hours ‘til you come back home  

				Sleepless days and restless nights  
				I’m haunted by your fading light  
				Can’t eat, can’t breathe, I’m falling fast  
				How long does love like this last?  

				I swear I catch your shadow’s trace  
				In every corner, every place  
				But the silence is my cruel fate  
				And I’m just waiting, can’t escape  

				Can I go on, can I hold the flame  
				When all that’s left is just your name?  
				I’m wide awake, can’t lose my grip  
				On the hope that I might feel your lips  

				Sleepless days and restless nights  
				I’m haunted by your fading light  
				Can’t eat, can’t breathe, I’m falling fast  
				How long does love like this last?  

				If love’s a fire that burns me through  
				I’m ready now to burn for you  
				But tell me why I’m left to pray  
				For somebody who’s slipped away  

				Sleepless days and restless nights  
				I’m haunted by your fading light  
				Can’t eat, can’t breathe, I’m falling fast  
				How long does love like this last?  

				Sleepless days and restless nights  
				My heart’s a ghost in empty flights  
				Hope’s the thread that’s holding me  
				Till you come back and set me free."
    },
    "13": {
      "title": "On The Edge",
      "hasLyrics": true,
      "lyrics": "If she’s gone, do I keep walking through the night?  
				Standing on the edge beneath the fading light  
				Her voice a whisper caught inside my chest  
				Without her here, I’m a shadow, I’m a guest  

				I’m on the edge, ready to leap, fall through the sky  
				Back into the black where all the colors die  
				The air is stale, the world turns pale without her flame  
				Do I fight to stay or fall back into the pain?  

				If she’s gone, do I go on without her grace?  
				Or retreat to broken love’s cold, empty space?  
				The night is heavy, silence thick like rust  
				Without her light, everything turns to dust  

				I’m on the edge, ready to leap, fall through the sky  
				Back into the black where all the colors die  
				The air is stale, the world turns pale without her flame  
				Do I fight to stay or fall back into the pain?  

				If she’s gone, I’m lost inside the endless dark  
				No spark to guide me, no fire for this heart  
				But maybe in the black, I’ll learn to breathe again  
				Find a way back to the light, beyond the end  

				I’m on the edge, ready to leap, fall through the sky  
				But maybe I’ll hold on, not say goodbye  
				The air’s still stale, but I’ll find one last flame  
				With or without her, I’ll face the pain."
    }
  }
}



