{
  "albumId": "NineLivesTwoSouls",
  "albumTitle": "Nine Lives, Two Souls",
  "tracks": {
    "1": {
      "title": "Nine Lives, Two Souls",
      "hasLyrics": true,
      "lyrics": "Step in the club, tail flickin' wild,\nNine lives spinning, every mood compiled.\nFunky bass, disco grooves, I'm the feline king,\nAuto-tuned meows makin' all the party sing!\n\nSometimes I purr, sometimes I bite,\nSwitch it up like a neon light.\nTwo souls dancing in my eyes,\nUnpredictable, a sweet surprise.\n\nNine lives, two souls, can't pin me down,\nOne moment queen, next I own the town.\nFlip the script, I'm your midnight delight,\nSometimes I'm soft, sometimes I fight.\n\nCatch me moonwalking on laser beams,\nBounce to the horns, living out my dreams.\nRandom vibe, electric and bright,\nOne thing's for sure: I own the night!\n\nSometimes I'm nice, sometimes I bite,\nYou never know what you're gonna get tonight!\nCrazy paws and a wild disco beat,\nNine lives, two souls, can't take the heat!\n\nJump, spin, so sleek, so sly,\nParty till the sun wakes the sky.\nFunky cat with mystery in my stride,\nRide the rhythm — it's a nine lives ride!\n\nSometimes I'm nice, sometimes I bite,\nYou never know what you're gonna get tonight!\nTwo souls partyin' til morning light,\nNine lives legend, outta sight!"
    },
    "2": {
      "title": "Purr Machine",
      "hasLyrics": true,
      "lyrics": "Slide through the room, tail in the groove,\nGot that silver shine, watch me as I move,\nVelvet paws on the beat, rhythm in my stride,\nI'm the midnight whisper that's dancing on your side.\n\nSilver whispers purr, yeah, I'm revving up my sound,\nTurn the dials, feel the waves, let 'em spin you around,\nSlick and sly, I'm the king of soft delight,\nI'm your secret weapon for a funky night.\n\nI'm a purr machine, making you feel fine,\nTurn me on baby, I'll blow your mind!\nI'm a purr machine, smooth and so divine,\nSpin it up loud, let the good times shine!\n\nSilk and shadow, power in my tongue,\nGot the bassline running while my motor's sprung,\nFeline fever with a pulse that won't quit,\nCatch the vibe, feel the heat, every single bit.\n\nLazy eyes flashing like a disco light,\nUnderneath the moon, I own the night,\nCurl up close, let my humming start,\nI'm the vibration that's warming up your heart.\n\nI'm a purr machine, making you feel fine,\nTurn me on baby, I'll blow your mind!\nI'm a purr machine, smooth and so divine,\nSpin it up loud, let the good times shine!\n\nDon't need no DJ, just my natural sound,\nPurring so sweet, gonna shake the ground,\nWatch me go, I'm the groove unseen,\nC'mon, come closer, I'm your purr machine!\n\nI'm a purr machine, making you feel fine,\nTurn me on baby, I'll blow your mind!\nI'm a purr machine, smooth and so divine,\nSpin it up loud, let the good times shine!"
    },
    "3": {
      "title": "Knock Knock, It's Me!",
      "hasLyrics": true,
      "lyrics": "Knock knock, it's me! Your furry security!\nPaws on the prowl, I'm ready, can't you see?\nSneaky shadows try to creep, but I'm the queen of this street,\nWatchful eyes wide open, guarding every heartbeat.\n\nIn the darkest night, when the world feels cold,\nI'm the silent sentinel, brave and bold.\nWhiskers twitching, tail so high,\nI'm your knight in fur under moonlit sky.\n\nKnock knock, it's me! Your furry security!\nI'll chase away the scary things while you sleep peacefully!\nFrom the window sill to the front porch light,\nI'm the hero who's here to make everything right.\n\nHear the thunder of paws, a rallying call,\nI'm the protector on the rise, standing tall.\nNo ghost or goblin can cross my line,\n'Cause every nook and cranny is safely mine.\n\nKnock knock, it's me! Your furry security!\nI'll chase away the scary things while you sleep peacefully!\nJumping, running, fierce and free,\nI'm the guardian cat—you're safe with me!\n\nKnock knock, it's me! Your furry security!\nDream without a worry, I'm your loyal company!\nWith a roar and a purr, I'm your fearless decree,\nKnock knock, it's me—your house's heartbeat!"
    },
    "4": {
      "title": "Dead Mouse Blues",
      "hasLyrics": true,
      "lyrics": "I brought you a mouse, I brought you a bird\nWhy are you screaming? That's just absurd!\nI brought you a prize from my wild little cruise\nDon't you love my funky, fresh dead mouse blues?\n\nI stalked through the night, I hunted with grace\nA treasure for you, it's right in my face\nYou turn up your nose, say \"Get that cat loose!\"\nBut I'm just proud of my dead mouse blues\n\nI brought you a mouse, I brought you a bird\nWhy are you screaming? That's just absurd!\nI brought you a prize from my wild little cruise\nDon't you love my funky, fresh dead mouse blues?\n\nI'm a little confused, but I'm feeling alright\nBringing gifts to the humans, born to excite\nSo take this rodent, it's fresh, it's news\nA funky little gift from your bluesy cat muse\n\nI brought you a mouse, I brought you a bird\nWhy are you screaming? That's just absurd!\nI brought you a prize from my wild little cruise\nDon't you love my funky, fresh dead mouse blues?"
    },
    "5": {
      "title": "Lap Cat Fever",
      "hasLyrics": true,
      "lyrics": "Sunbeam hunter, sneakers soft on the floor\nMaster of the purr, knocking at your door\nTail tips sway with a rhythm so sweet\nSlide into your lap, got you on your feet\n\nGot the kind of heat that melts through the night\nChasing all your troubles, making everything right\nWith a flick and a twitch, I'm the charm you keep\nWake up from your daydream, ain't no time for sleep\n\nI've got that lap cat fever, I'll make you a believer\nIn the power of my cuddles, I'm your best receiver\nStuck to you like glue now, no need to be a dreamer\nWith a heart full of purrs, I'm the ultimate redeemer\n\nFur like a velvet wave, eyes glinting gold\nSaxophone whispers tell the tales I hold\nClap along to the rhythm, feel the funky groove\nI'm the lap monarch, making every move\n\nChasing shadows, and stealing the show\nWith a nimble little leap, I'm your main tableau\nEvery single cuddle's a jam, can't deny\nFeel the spark when I settle, don't even try\n\nI've got that lap cat fever, I'll make you a believer\nIn the power of my cuddles, I'm your best receiver\nStuck to you like glue now, no need to be a dreamer\nWith a heart full of purrs, I'm the ultimate redeemer\n\nOh oh, paws tapping to the beat\nOh oh, curling up so sweet\nLap cat fever running wild\nI'm the cheeky, charming child\n\nI've got that lap cat fever, I'll make you a believer\nIn the power of my cuddles, I'm your best receiver\nStuck to you like glue now, no need to be a dreamer\nWith a heart full of purrs, I'm the ultimate redeemer\n\nLap cat fever, lap cat fever\nKeep the love close, I'm your fever\nLap cat fever, lap cat fever\nCuddle king, your heart's believer"
    },
    "6": {
      "title": "Sunbeam Surfing",
      "hasLyrics": true,
      "lyrics": "Wake up, tail flick, the morning calls my name\nSunlight's streaming through, turning corners into flame\nPaws on the floor, the chase has just begun\nDarting through the hall, I'm dancing with the sun\n\nSunbeam surfing all day long\nFollowing the light, singing this song!\nFrom window to corner, I'm riding the rays\nPure joy in my whiskers, in these golden waves\n\nSlipping through the kitchen, a spotlight on the tile\nJumping, flipping, twisting, style after style\nEvery patch a playground, every ray a ride\nI'm the feline surfer, the house is my tide\n\nSunbeam surfing all day long\nFollowing the light, singing this song!\nFrom window to corner, I'm riding the rays\nPure joy in my whiskers, in these golden waves\n\nWhen the world gets quiet, I curl up with ease\nWrapped in warm sunlight, the softest breeze\nDreaming of my surfing on the sun's bright sea\nA sparkling feline floating wild and free\n\nSunbeam surfing all day long\nFollowing the light, singing this song!\nFrom window to corner, I'm riding the rays\nPure joy in my whiskers, in these golden waves\n\nSunbeam surfing all day long\nFollowing the light, singing this song!\nCome join the ride, feel the warmth and the fun\nRiding golden currents, until the day is done!"
    },
    "7": {
      "title": "Midnight Patrol Party",
      "hasLyrics": true,
      "lyrics": "Whiskers twitchin' under neon moons,\nSneakin' past shadows in electric tunes,\nTail flicks like a disco light,\nGlidin' through the streets of velvet night.\n\nMidnight patrol party, checking every room,\nMaking sure everything's cool until the morning bloom!\nJungle beats on my paws, strut with funky grace,\nEvery corner's got a secret in this cosmic place.\n\nLuminous eyes scan the sleeping blooms,\nJumpin' fences, chasing sonic booms,\nVelvet paws on the cool tiled floor,\nI'm the groove in the night, can't ask for more.\n\nMidnight patrol party, checking every room,\nMaking sure everything's cool until the morning bloom!\nJungle beats on my paws, strut with funky grace,\nEvery corner's got a secret in this cosmic place.\n\nFunky bass hummin' in my whiskered soul,\nDreamy synth waves make the darkness roll,\nNeon dreams pulse through my royal fur,\nThis night's alive, hear the wild purr.\n\nMidnight patrol party, checking every room,\nMaking sure everything's cool until the morning bloom!\nJungle beats on my paws, strut with funky grace,\nEvery corner's got a secret in this cosmic place."
    },
    "8": {
      "title": "Zoomies at 3 AM",
      "hasLyrics": true,
      "lyrics": "3 AM zoomies, gotta go fast,\nUp the walls, down the halls, this energy's gonna last!\nScratchin' post like a beast unleashed,\nWhiskers twitchin', no sign of peace!\n\nAir horn blast, cat's on the chase,\nTail's a whip, lightning pace!\nWindow leap, catch that fly,\nMidnight madness in my feline eye.\n\nBounce bounce bounce, electrify,\nCrazy paws, laser light sky.\nChasing shadows, skrrt skrrt, boom,\nParty's live in the living room!\n\n3 AM zoomies, gotta go fast,\nUp the walls, down the halls, this energy's gonna last!\n3 AM zoomies, break the mold,\nWild and free, never cold!\n\nFur flies like a strobe parade,\nPounce on beats that Major made.\nDie Antwoord style with a crazy twist,\nCan't stop, won't quit, feel the bass hit!\n\nSpin like a top, claws dig deep,\nNo time for naps, no time for sleep.\nCatnip dreams turn to turbo flights,\nLiving loud in the neon night!\n\n3 AM zoomies, gotta go fast,\nUp the walls, down the halls, this energy's gonna last!\n3 AM zoomies, party's prime,\nMidnight madness, feline crime!"
    },
    "9": {
      "title": "Gravity Sucks",
      "hasLyrics": true,
      "lyrics": "Gravity sucks but I love to push,\nWatch your stuff fall with a little whoosh!\nPens and cups, they gotta go down,\nI'm the chaos queen wearing the crown\n\nEvery surface is my playground,\nKnocking treasures to the ground\nMischievous grin, tail held high,\nWatch me make your coffee fly!\n\nGravity sucks but I love to push,\nWatch your stuff fall with a little whoosh!\nMischievous but upbeat and catchy,\nMaking all your neat things scattered and patchy!\n\nTap tap tap with my little paw,\nTesting physics without a flaw\nDown it goes with a satisfying crash,\nI'm the feline making a dash\n\nC'mon everybody, let's get on track\nJoin the crazy fun with my gravity attack!\nSing along to my catchy tune,\nKnocking stuff down from night till noon!\n\nGravity sucks but I love to push,\nWatch your stuff fall with a little whoosh!\nMischievous but upbeat and catchy,\nMaking all your neat things scattered and patchy!"
    },
    "10": {
      "title": "Invisible Friends",
      "hasLyrics": true,
      "lyrics": "Dancing shadows in the afternoon light\nI chase the sparkles that vanish out of sight\nWhiskers twitching at the silent breeze\nPlaying tag with ghosts only I can tease\n\nI've got invisible friends, we play all day\nYou think I'm crazy but we're just having fun our way\nJumping through the air, a secret ballet\nWith my invisible friends, the world's a bright display\n\nPaws on the carpet, but nothing's there\nA flicker, a flash, it's magic in the air\nSpinning circles 'round a thing you can't find\nSharing the joy in this game we designed\n\nI've got invisible friends, we play all day\nYou think I'm crazy but we're just having fun our way\nJumping through the air, a secret ballet\nWith my invisible friends, the world's a bright display\n\nInvisible strings pull me to a higher spin\nA playful riddle with a whiskered grin\nLaughing in the quiet, purring with delight\nIn my little universe, everything feels right\n\nI've got invisible friends, we play all day\nYou think I'm crazy but we're just having fun our way\nJumping through the air, a secret ballet\nWith my invisible friends, the world's a bright display\n\nYou can't see them but they're here,\nDancing in the light, so clear—\nMy invisible friends and me,\nTogether wild, forever free!"
    },
    "11": {
      "title": "Selective Hearing Champion",
      "hasLyrics": true,
      "lyrics": "Step up in the club, spotlight on me\nSelective hearing king, yeah, that's the key\nTreat bag crinkle, I catch that sound\nFrom a mile away, I'm the best around\n\nYour voice calls my name? Nah, I don't play\nI'm tuned to the beats that make me sway\nBass hit hard, feel the floor ignite\nSelective hearing champ, I own the night\n\nI'm the champion of hearing what I want,\nTune out the noise, I flaunt the flaunt,\nTreat bag shake from a mile away,\nYour voice calling my name? No way!\n\nSnap of a finger, I'm locked on the prize\nOnly the party vibes cut through the lies\nWhiskers twitch, I don't miss a beat\nSelective hearing skills can't be beat\n\nGot that radar for the sound that thrills\nDodge every call, flex my golden skills\nI hear the bass, DJ drops the heat\nSelective hearing champ, can't be beat!\n\nI'm the champion of hearing what I want,\nTune out the noise, I flaunt the flaunt,\nTreat bag shake from a mile away,\nYour voice calling my name? No way!\n\nGot the club on fire, I own this floor\nSelective hearing's what they adore\nI'm the cat with ears to make you freeze\nBraggin' rights earned with the greatest ease\n\nEchoes fade, but I'm tuned in tight\nOnly what I want, all day, all night\nSelective hearing champ, top of the game\nParty anthem loud, remember the name!\n\nI'm the champion of hearing what I want,\nTune out the noise, I flaunt the flaunt,\nTreat bag shake from a mile away,\nYour voice calling my name? No way!"
    },
    "12": {
      "title": "Ankle Attack",
      "hasLyrics": true,
      "lyrics": "Creepin' on the carpet, whiskers twitchin' tight\nPounce mode activated, stealth is my delight\nSneaky little ninja with a fluffy attack\nEyes locked on the target — it's the ankle, jack!\n\nAnkle attack, coming from the back\nHide under the chair, strike when you're not aware!\nTiptoe on the tile, bounce like a spring cat\nYou can't outrun me, I'm the ankle rap king, that's a fact!\n\nRubber squeak, pop, zip—hear the silly sound\nTail flick, claws click, I'm the funnest cat around\nJumpin' like a jackrabbit, lightning on a chase\nAnkle's my playground, I'm the master of this race\n\nAnkle attack, coming from the back\nHide under the chair, strike when you're not aware!\nPlaytime on the prowl, got my game face on\nTime to shake those feet to my funky cat song\n\nSlap that sock, nibble a bit, let's keep this party live\nMaking all the humans jump and hop, watch me thrive\nIt's a playful predator, not a scary scheme\nJust a whiskered enthusiast living ankle-hunting dreams\n\nAnkle attack, coming from the back\nHide under the chair, strike when you're not aware!\nC'mon everybody, let's get on track\nJoin the crazy fun with the ankle attack!"
    },
    "13": {
      "title": "Hairball Revenge",
      "hasLyrics": true,
      "lyrics": "Eyes wide open, stalking your dreams,\nSilent predator, tearing at the seams.\nPurring like a devil, plotting my attack,\nWait till you're comfy, then I'm launching my plaque.\n\nHairball revenge, right on your bed,\nFresh white sheets? That's where I'll spread!\nSpewing my glory, a snotty surprise,\nWatch you jump up with disgust in your eyes!\n\nSkitter and scratch, I'm your nightmare's pet,\nTiming my horror, placing my net.\nLurking in shadows, the queen of gross,\nI'm your furry fiend, with a vengeful dose.\n\nHairball revenge, right on your bed,\nFresh white sheets? That's where I'll spread!\nSpewing my glory, a snotty surprise,\nWatch you jump up with disgust in your eyes!\n\nFast and furious, a furry disgrace,\nI'm the rebel menace all over the place.\nNext time you're chillin', best watch your step,\nOr I'll drop my bomb with a jagged rep.\n\nHairball revenge, right on your bed,\nFresh white sheets? That's where I'll spread!\nSpewing my glory, a snotty surprise,\nWatch you jump up with disgust in your eyes!"
    },
    "14": {
      "title": "Dogs Don't Get It [Found Track]",
      "hasLyrics": true,
      "lyrics": "I see you chase your tail but then you stop and stare\nAt shadows on the wall like they're some secret lair\nYou knock things off the shelf just to watch them fall\nThen you nuzzle up but don't respond at all\n\nDogs don't get it, cats are weird\nThey do stuff that makes no sense, but somehow they're endeared!\nJumping, pouncing, sudden flight\nYou vanish in the day, then howl at the night\n\nYou lick your fur like it's a gourmet dish\nThen freak out when you sniff a fish\nYou scratch the couch but act real cool\nLike breaking stuff's a feline rule\n\nDogs don't get it, cats are strange\nThey rule the house but never play the same\nClimbing curtains, knocking vases down\nAnd still, you're the quirkiest kings and queens in town\n\nI tried to chase a laser dot, I swear it moved so fast\nYou just sat there, rolling eyes, like \"Dude, that's old and passé\"\nYou nap so much, you're basically a furry ghost\nBut when you zoom around the room, I'm like \"Okay, I'm impressed the most!\"\n\nDogs don't get it, cats are weird\nThey do stuff that makes no sense, but somehow they're endeared!\nConfused but happy, wagging tail cheer\nLiving in cat logic—yeah, I'll stick around here!"
    }
  }
}