{
  "albumId": "polka_please",
  "albumTitle": "Polka, Please",
  "tracks": {
    "1": {
      "title": "Polka, Please",
      "hasLyrics": true,
      "lyrics": "Slow it down now, every Polka think they run the town\nBut I'm steady movin' up, never lettin' that crown down\nUsed to hear 'em talkin' loud, try to put me in the dirt\nNow I'm on a different wave, Polka words don't mean a hurt\n\nTurn the pain to power, every slight just fuels my grind\nThey chuck the shade but I'm the light that always shines\nPolka thrown like stones, but I built this fortress tight\nElevate above the noise, makin' darkness into light\n\nPolka, please, can't phase me, I'm too focused on my rise\nPolka, please, you're just noise, but I'm the truth in disguise\nPolka, please, keep talkin', I'm just settin' up my throne\nPolka, please, your words rebound, but I'm too far gone\n\nStanding tall, scars and all, made me who I am today\nUsed to hear the laughs, now I'm the one they wanna play\nPolka tried to break me down but I flipped it on its head\nNow that word's my anthem, a crown upon my head\n\nFrom the struggle to the stage, every line a legacy\nPolka can't define me, I'm writing history\nFacing every challenge, never bowin' to the sneers\nPolka never broke me—turned my weakness into gears\n\nPolka, please, can't phase me, I'm too focused on my rise\nPolka, please, you're just noise, but I'm the truth in disguise\nPolka, please, keep talkin', I'm just settin' up my throne\nPolka, please, your words rebound, but I'm too far gone\n\nYeah, every Polka word just flips into my fuel\nTurned a curse to a crown, now watch me rule\nYou can't box me in, no labels gonna stick\nPolka, please, I'm the storm—watch me flip the script."
    },
    "2": {
      "title": "Polka Drop",
      "hasLyrics": true,
      "lyrics": "Accordion teasing, spinning wild in the night\nTuba thumping, heartbeat syncing to the light\nOom-pah bouncing, feet ready on the go\nGlitched vocal calling through the stereo\n\nLet's Polka! (chop-chop)\nBass drops deep, feel the fire in your soul\nLet's Polka! (break it down)\nOld school clash with the future's bold control\n\nTwist the twirl, break the swirl, electric swirl of sound\nBrass hits sharp, tearing up this dancefloor ground\nSynths collide with folk pride, a raucous feud\nEnergy rising, ancient beats renewed\n\nLet's Polka! (cut-cut)\nStabs of brass ignite thunder, roar and roll\nLet's Polka! (wob-wob)\nStep by step, break the mold, lose control\n\nAccordion winks, glitchy samples jump and dive\nDubstep pulses, it's the classic come alive\nRaise your hands, let the rhythm claim your heart\nTwo worlds spinning, tearing seams apart\n\nLet's Polka! (snap-snap)\nFeel the clash, the burn, the soul unfold\nLet's Polka! (drop-drop)\nOne last surge, a story boldly retold\n\nLet's Polka! (fade out, fade in)\nOom-pah boots, wobbling bass, fire and gold\nLet's Polka! (echo)\nTonight we dance, together breaking every mold!"
    },
    "3": {
      "title": "Polka Like It's Hot",
      "hasLyrics": true,
      "lyrics": "Accordion snaps, tuba pops, slide to the floor, let the party rock\nStep in the scene, fresh and clean, polka rhythm with a hip-hop gleam\nClarinets punctuate the beat, drum machine keepin' it neat\nSlide to your left, spin to your right, funkadelic polka all night\n\nWe polka like it's hot, no iceberg in this spot\nStep up, break it down, twirl that skirt, that's what we got\n\"Hey, hey, slide it back!\" — \"Bounce it up, don't you stop!\"\nWe polka like it's hot, yeah, we polka like it's hot\n\nCool cats in the back with the accordion attack\nGot the tuba rumble, bass lines deep, no slack\nSnap your fingers like a boss, throw your hands in the sky\nPolka suits and basketball shoes, watch the funk amplify\n\n\"Who's the slick slicker?\" — \"Dogg with the polka ticker!\"\nSlide and glide, don't hitch that hitchhiker\nCrisp beats flip with a zesty twist, no likey? You're missin' the gist\nTurn up the heat while we stomp these boots, we ain't just playin', we raise the roof\n\nWe polka like it's hot, no iceberg in this spot\nStep up, break it down, twirl that skirt, that's what we got\n\"Hey, hey, slide it back!\" — \"Bounce it up, don't you stop!\"\nWe polka like it's hot, yeah, we polka like it's hot\n\nAccordion licks got you hooked on the spot,\nTuba bass vibrates your soul nonstop\nClarinet grooves weave through that funky polka hop\nDJ spin, let the record drop, dancefloor's poppin', can't be forgot\n\n\"Spin, spin, keep it real!\" — \"Slide, slide, tell me how it feel!\"\nLaugh it up, shake it loose, good times always seal the deal\nFrom the streets to the fest, we're the polka-lovin' best\nChillin' so cool, with the groove impressed, no contest, yes yes yes!\n\nWe polka like it's hot, no iceberg in this spot\nStep up, break it down, twirl that skirt, that's what we got\n\"Hey, hey, slide it back!\" — \"Bounce it up, don't you stop!\"\nWe polka like it's hot, yeah, we polka like it's hot!"
    },
    "4": {
      "title": "Polka Poker Face",
      "hasLyrics": true,
      "lyrics": "Whispering secrets in the neon glow,\nAccordion's ruffle, let the wild winds blow,\nThey call me crazy, but I live for the show,\nDazzling with a smirk, watch me steal the glow.\n\nStep into the chaos, don't hold back the grin,\nHeartbeat pounding, let the game begin,\nFlamboyant flames burning deep within,\nPoker polka face, let the madness spin.\n\nOh, I'm a riddle wrapped in a jig,\nShaking up the mirror, I dance the wig,\nUnapologetic, I'm unapologetically big,\nYou can try to tame it, but I'm too zig-zag.\n\nSpin your fears into a swirling mask,\nCatch my sparkle, hide behind the flask,\nMisfit magic, no need to ask,\nDancing on the edge with a daring blast.\n\nStrut through the fire, wild queen on parade,\n shimmering chaos, I've got it handmade,\nEvery step a flashy charade,\nPoker polka face—glamour's renegade.\n\nWink at the shadows, taunt the night,\nFender-fender, step into the light,\nMischief's calling, everything's alright,\nRaise your hands, ignite the fight!\n\nOh, oh, oh, yeah!\nHa ha ha!\nCome on, come on—let's go!\nHa ha ha!\nFeel the beat, feel the glow!\nHa ha ha!\nDance till the curtains close—won't say no!\n\nKing of the shuffle, queen of the flash,\nWhirl in the chaos, lightning strike clash,\nNo apologies, just a splash,\nPoker polka face—with a mighty splash!\n\nNow scream it louder, make the world spin,\nFabulous secrets locked under the skin,\nLife's a gamble, let's all begin,\nStarry-eyed, with a devilish grin!"
    },
    "5": {
      "title": "Polka Line Blues",
      "hasLyrics": true,
      "lyrics": "I woke up in Memphis with a devil on my tail\nSteel wheels poundin', through the midnight gale\nLost my woman in a roadside bar, on Highway 9\nNow I'm dancin' with the polka line blues, 'cross the state line\n\nBoxcar hummin' like a lonesome drum, callin' out my name\nEvery whistle blowin' cuts like a runaway train\nHeartbreak's just a ticket stub I burned long ago\nBut this ol' restless soul's got miles left to go\n\nStep lively, friends, hear that fiddle cry\nStomp your boots, let your worries fly\nPolka line blues ain't just a tune, it's the road I choose\nTurnin' lost nights into dance floor truths\n\nCity lights fade and the dust starts to rise\nChasing down sunsets under open skies\nLove may fade like a worn-out tattoo\nBut you find redemption in the rhythm true\n\nSteam engine's callin' down a lonesome track\nNever lookin' forward just to lookin' back\nBut the future's a dance I'm gonna lead, no excuse\nSteppin' proud with my polka line blues\n\nStep lively, friends, hear that fiddle cry\nStomp your boots, let your worries fly\nPolka line blues ain't just a tune, it's the road I choose\nTurnin' lost nights into dance floor truths\n\nOh, the road may bend and the nights get cold\nBut a wanderer's heart is never sold\nWith each pry and pull of the accordion's muse\nI'm home again in my polka line blues"
    },
    "6": {
      "title": "Polka Shock",
      "hasLyrics": true,
      "lyrics": "Yo, I'm that wild card, polka in my veins, twistyloops in my brain, gotcha money knocked out, call me the oddball king,\nBeat bangin' like a Mideast festival, flip the script, ritual, I'm spittin' viral, break chains, shatter frames, yeah, I'm the original,\nStereotypes? I melt 'em, jingle bells turn rebel, suit-and-tie? nah, I'm the scarlet letter,\nCrown tilted, crooked style, freak show stalker, I'm the shock therapy, raw polka shocker.\n\nLaughin' at the doubters, clowns in the circus, they can't see the fire, burn 'em till they surface,\nClown shoes, oversized ego, I stand out, flash like neon, eccentric hero—no remorse, no zero,\nMagnifico, I stitch the odd, bizarre chic, I'm the new mode, unique, mask missing, streets listen when I speak,\nShock value, my protocol, offbeat, satire—call me what you want, I'm a high-voltage flyer.\n\nI flip stereotypes, get hype with the quirks,\nPolka's a riot, each beat a jerk,\nOwn my weirdness, wear it like a badge,\nThey try to clown but I own the scat, no drag,\nDis me? I laugh, push back with a snare,\nUnderdog, loud, yeah, I dare you stare,\nEuropean bounce, Detroit grit, I'm the hybrid hit,\nTurn the oddball into a riot, never quit!\n\nYour rules? Nah, I rewire, twist the game, break the wire,\nSlingin' punchlines, my squire,\nCortex wired, I'm the outsider getting fired,\nShatter, shatter, I climb higher,\nPolka's the brand, I demand, hand in hand with chaos,\nClown with the terrain, I dance in the madness,\nComic, savage, demand the status,\nOwn my quirks, cause I got the madness and the badges.\n\nYeah, I'm the shock, the jolt, the glitch,\nA glitch in the matrix, broke the switch,\nYou see the sparkle, the weird, the flick,\nI'm your favorite anomaly, sarcastic and quick,\nGot 'em all shook, they hate or admire,\nIndie fire, never tire,\nPolka shock, you're fired,\nOwn the odd, inspire, rebirthed, wired."
    },
    "7": {
      "title": "Polka Vibration",
      "hasLyrics": true,
      "lyrics": "Feel the rhythm, feel the night,\nHands together, shining bright,\nFrom the mountains to the sea,\nOne love, one dance, one melody.\n\nPolka vibration in the air,\nBounce your spirit everywhere,\nFrom tiny towns to city lights,\nWe sway as one through endless nights.\n\nDance, dance, shake your soul free,\nNo borders here, just unity,\nAll our hearts beat to the same song,\nCome on now, let's move along.\n\nFeet stompin', hearts callin' true,\nColors blend in every hue,\nRaise your voice, break every chain,\nCalling peace in every vein.\n\nPolka vibration, can't you see?\nWe're one big family,\nStep by step, and hand in hand,\nWe bring the fire to this land.\n\nDance, dance, shake your soul free,\nNo borders here, just unity,\nAll our hearts beat to the same song,\nCome on now, let's move along.\n\nFrom far away or near at home,\nTogether now, we're never alone,\nLift your spirit, hear the call,\nOne earth, one love, one for all.\n\nDance, dance, shake your soul free,\nNo borders here, just unity,\nAll our hearts beat to the same song,\nCome on now, let's move along."
    },
    "8": {
      "title": "Polka Iron Sabbath",
      "hasLyrics": true,
      "lyrics": "Shadows twist in carnival flame,\nMasked eyes pierce through smoke and rain,\nGhosts of polka, midnight's breath,\nDance on edges, flirting with death.\n\nIron fists in satin gloves,\nBloodied beats from ancient loves,\nWhirling madness, steel-on-steel,\nThe sabbath's call you'll have to feel.\n\nRaise your horns, the night undone,\nMarching under moon and gun,\nFeral cries on fractured ground,\nIn this wild sound, we're glory-bound.\n\nPolka Iron Sabbath, thunder rolls,\nChains and laughter shake your soul,\nMarch the line 'twixt doom and dance,\nIn this darkened, twisted trance.\n\nWhispers crawl from shadowed tents,\nBarrels roll with dark intents,\nStrangers' eyes like burning coals,\nSecrets traded in midnight bowls.\n\nThe polka spirals, harsh and bold,\nAn iron story carved and told,\nUnderneath the circus sin,\nA rebel's howl begins to spin.\n\nPolka Iron Sabbath, thunder rolls,\nChains and laughter shake your soul,\nMarch the line 'twixt doom and dance,\nIn this darkened, twisted trance.\n\nRaise your glass to fallen kings,\nHear the clang the nightbird sings,\nMetal hearts and twisted fate,\nJoin the frenzy—don't be late.\n\nPolka Iron Sabbath, thunder rolls,\nChains and laughter shake your soul,\nMarch the line 'twixt doom and dance,\nIn this darkened, twisted trance."
    },
    "9": {
      "title": "Polka Over the Rainbow",
      "hasLyrics": true,
      "lyrics": "Sun shine soft on golden sand,\nUkulele strum in gentle hand,\nOld polka beats a joyful sound,\nWhere ocean waves and hearts are bound.\n\nRainbows arch across blue skies,\nLanterns glow with island light,\nCome gather close, come share the song,\nWith aloha deep and dance along.\n\nPolka over the rainbow, hand in hand we go,\nUnder palm tree shadows, feel the warm winds blow,\nHearts in harmony, beneath this endless sea,\nCome dance with me, come dance with me.\n\nLanai breeze and laughter bright,\nTropical stars guide the night,\nThe island calls, the music flows,\nIn every step, our spirit grows.\n\nPolka over the rainbow, hand in hand we go,\nUnder palm tree shadows, feel the warm winds blow,\nHearts in harmony, beneath this endless sea,\nCome dance with me, come dance with me.\n\nForever in this gentle sway,\nWhere dreams and tides both play,\nWith smiling faces all around,\nLove's the rhythm, sweet and sound.\n\nPolka over the rainbow, hand in hand we go,\nUnder palm tree shadows, feel the warm winds blow,\nHearts in harmony, beneath this endless sea,\nCome dance with me, come dance with me."
    },
    "10": {
      "title": "Papa's Got a Brand New Polka",
      "hasLyrics": true,
      "lyrics": "Hey! Everybody gather 'round, listen here!\nPapa's struttin' in with that polka gear, UH!\nGot the accordion bumpin', bass drum thumpin' loud,\nThis ain't no quiet dance, it's a funky, stompin' crowd!\n\nSlide to the left, then kick to the right!\nSpin that partner 'round, make it tight tonight!\nDon't just stand there, break those chains,\nPapa's bringin' the fire, polka in your veins! UH!\n\nPapa's got a brand new polka, get on your feet—\nClap your hands, stomp your shoes, move to that beat!\nHey! Pump it up, shake it down, shout it loud—\nWe're the kings of the dance, making polka proud!\n\nUh! Feel that rhythm? It's a funky explosion,\nPolka's got soul now, no need for posin'!\nOld school roots but with a new twist,\nPapa's got the juice, you don't wanna miss!\n\nHop three steps, slide back, then jump—UH!\nWave your arms, yell \"Go!\" until you're pumped!\nThis ain't your grandpa's quiet jig, nah, no!\nIt's a funky polka riot, watch us steal the show!\n\nPapa's got a brand new polka, turn up that heat—\nEvery single stubborn foot gotta meet the beat!\nHey! Clap your hands, stomp your shoes, move to that beat!\nGet up offa that thing, from your head to your feet!\n\nUH! UH! Whoa! Break it down slow—(talking)\nNow watch me shiiiine, watch me glide!\nUh, uh, uh—baby, jump inside—Yeah!\nPolka fever slick and wild, can't deny!\n\nPapa's got a brand new polka, making noise—\nThis ain't no soft dance, it's high step joy!\nWanna dance, wanna shout, wanna cause a mess?\nThen follow Papa's groove, and get ready to flex!\n\nCome on! Clap your hands, stomp your shoes, move to that beat!\nHey! Get up offa that thing, we own this street!\nPapa's got a brand new polka, the king's decree—\nPut your hands up, shout out loud, let's make history!\n\nUH! UH! UH! Woo!\nGet on up, get on out, polka funk's about!\nPapa's got a brand new polka! Yeah!"
    },
    "11": {
      "title": "Born to Polka",
      "hasLyrics": true,
      "lyrics": "I grew up where the gravel meets the tar,\nWhere the factory whistle blows at five past four,\nMama swept the floor with a smile so wide,\nDaddy's worn boots kept the rhythm of our pride.\n\nOn Friday nights at the corner hall,\nThe polka band starts and the tired all stand tall,\nFlashing lights, spirits high, in a sea of dust,\nWe find a little freedom in the sweat and trust.\n\nWhoa-oh! Born to polka, born to roll,\nHeartland fire burning in every soul,\nFrom broken dreams to the open road,\nWe dance through the hard times, carry the load.\n\nJohnny worked the line down at the mill,\nWith calloused hands and a will that could never stay still,\nSally spun the stories in a jukebox tune,\nDreaming 'bout the day she might jump that moon.\n\nEvery scraped knee, every late night fight,\nWas just a step in the dance beneath neon light,\nWe raise our voices, shout it loud and free,\nIn the polka rhythm lies our victory.\n\nWhoa-oh! Born to polka, born to roll,\nHeartland fire burning in every soul,\nFrom broken dreams to the open road,\nWe dance through the hard times, carry the load.\n\nHarmonica crying with a sweet, raw sound,\nKeyboards like sunlight spilling all around,\nThis town might be small, but our hopes are large,\nTogether we stand, ready to charge.\n\nWhoa-oh! Born to polka, born to roll,\nHeartland fire burning in every soul,\nFrom broken dreams to the open road,\nWe dance through the hard times, carry the load.\n\nWhoa-oh! Raise your hands, lift your voice,\nIn the storm of the night, we rejoice,\nBorn to polka, born to roll,\nForever we're chasing that ragged soul."
    },
    "12": {
      "title": "Polka In My Boots",
      "hasLyrics": true,
      "lyrics": "Well, I'm struttin' through the barn with my boots laced up tight,\nRhinestones blingin' in the moonlight, honey, what a sight!\nGot a twirl in my step and a sparkle in my eye,\nBig hair bouncin' higher than the clouds up in the sky.\n\nFlip your partner, swing 'em 'round, let your worries loose—\nThere's a polka in my boots and it's callin' out for you!\nGot my heart on a ripple, my spirit's kickin' free,\nIn this satin, sequin dream, darlin', come dance with me!\n\nSugar, life's too short for flat jeans and low-talks,\nI'm the queen of curves and country-crazed barnwalks.\nWith a wink and a twang, I'm a rhinestone surprise,\nSpinnin' out my daydreams under firefly skies.\n\nSlide to the left, tap your heel, kick it with some flair,\nMy fiddle's laughin' louder than a county fair.\nI'm a glitter grenade of glam, in a polka swirl,\nEvery step's a spotlight for a southern girl.\n\nLet's kick up dust and kiss the stars, sassy as can be—\nBig dreams, bigger hair, and a whole lotta jubilee!\nFrom Nashville to your heart, with a wink and a hoot,\nThere's a polka in my boots—come shake it with your roots!\n\nHoney, I'm the sparkle in the neon, the diva on parade,\nTwistin' through the tangle of this honky-tonk charade.\nSo grab your hat and hold on tight, this ride's set to ignite—\nI'm a rhinestone wonder in the wild polka night!"
    },
    "13": {
      "title": "Polka Stardust",
      "hasLyrics": true,
      "lyrics": "Silver tap-shoes click on lunar tiles,\nWarped kaleidoscope in a prismed smile.\nVelvet suits stitched from the Milky Way,\nNebulae swirl as the band begins to play.\n\nMisfits weaving through in dappled light,\nWaltzing with quasars and electron sprites.\nTwisting tradition with a cosmic wink—\nSpinning cosmic tales on the polka brink.\n\nPolka stardust, twirl me through the night,\nFlashing neon glimmers and cosmic flight.\nStarman's bowtie snaps a nova's spark,\nDancing shadows stitch the velvet dark.\n\nElectric cheekbones carve the space between,\nFalsetto whispers where you've never been.\nPulsar hearts tapped out an alien beat,\nA disco-ball planet under flying feet.\n\nFootloose and strange, we shatter the norm,\nIn glimmering chaos, new rhythms form.\nA carousel of comets melts the black,\nEvery zigzag breath pulls the stars back.\n\nPolka stardust, twirl me through the night,\nFlashing neon glimmers and cosmic flight.\nStarman's bowtie snaps a nova's spark,\nDancing shadows stitch the velvet dark.\n\nUnderneath the lustrum of the velvet moon,\nWe twist old tales into a neon tune.\nOrbiting a ballroom spun from dreams,\nWhere strangers dance along the solar streams.\n\nSo raise your glass to the sky's parade,\nIn this starlit fever, we're all remade.\nNo earthly guise can contain this show—\nWe're the constellation's wildest glow.\n\nPolka stardust, twirl me through the night,\nFlashing neon glimmers and cosmic flight.\nStarman's bowtie snaps a nova's spark,\nDancing shadows stitch the velvet dark."
    }
  }
}