{
  "albumId": "Sinners-Feast",
  "albumTitle": "Sinner's Feast",
  "tracks": {
    "1": {
    "title": "Hold On, Stand Strong",
    "hasLyrics": true,
    "lyrics": "When the sky is heavy and the rain starts to fall\nand the world feels like it is after us all\nremember your not alone in this fight\nwe've got each other shining bright\nStorms come and go, but hope will show\nwith every breath we'll grow\nlift your head and see the dawn\nTogether we keep holding on\n\nHold on, stand Strong\nWe are in this Together\nthrough rain and Storms\nno matter the weather\nLift up your voice\nsing out your song\nWe're unbreakable, forever along\nhold on stand Strong,\nand never forget\nlove is the light we won't regret\nwe are one big family come what may\nholding hands to face each new day\n\nFace the judgement\nPush through the doubt\nHear the hope inside ya' shout\nEvery challenge makes us who we are\nFinding strength in who we are\nStorms come and go but hope will show\nwith every breath we'll grow\nLift your head and see the dawn\nTogether we keep holding on\n\nAnd when the night feels cold and long\nRemember we belong\nIn a world where hope is never gone\nWhere together we are strong\nWe are one big family come what may\nHolding hands to face each new day\nAnd when the night feels cold and long\nRemember we belong\nAnd when the night feels cold and long\nRemember we belong\nIn a world where hope is never gone\nhold on stand Strong"
    },
    "2": {
      "title": "Six Plants on my Balcony",
      "hasLyrics": true,
      "lyrics": "Six plants on my balcony legal and free\nGreen leaves in the sunlight that's the life for me\n\nSix per adult twelve per house that's the rule\nGrowing frosty buds nature's finest jewel\n\nSix plants on my balcony legal and free\nGreen leaves in the sunlight that's the life for me\n\nHarvest and hang trim and jar then start again\nOutdoor season on the coast just around the bend\n\nThirty-gallon smart pots bathed in the sun\nNot long 'til flower time as vegging is almost done\n\nSix plants on my balcony legal and free\nGreen leaves in the sunlight that's the life for me"
    },
    "3": {
      "title": "Spit On The Cat",
      "hasLyrics": true,
      "lyrics": "Spit on the cat, spit on the cat, spit on the caaat,\n\nFeel the winter's bite, hell's night in sight, ready for the fight.\nBass thumps, head bangs, chaos in the air,\nScream out the rage, life's a fucking snare.\n\nSpit on the cat, darkness rising slow,\nPorch ice, cat cries, in the freezing snow.\nNo holding back, just let it all out,\nEnd times roar, hear the devil's shout.\n\nSpit on the cat, world's gone mad,\nDemons in the veins, all the power you had.\nThroaty growl, heavy beats, break the silence,\nLife's a beast, all you know is violence.\n\nSpit on the cat, in the devil's grip,\nBlack clothes, long hair, whiskey on the lip.\nSmoke fills the air, chaos reigns supreme,\nSatan laughs loud, it's the end-time dream."
    },
    "4": {
      "title": "Suppertime Pizza",
      "hasLyrics": true,
      "lyrics": "Cookin' pizza\nIn the kitchen\nIt's a cheap supper\nI think it could be love\n\nNow I can't think of anything better\nIt takes two minutes to make\nIt's hot and steamy on a cold winter's day\nBaby\nGimme a break\n\n'Cause it's cold outside\nAnd you know the world is burnin'\nSo I'm just gonna make a little pizza pie\nNow you know I'm never hungry\n'cause I eat every night\nAnd I just don't have the time\n'cause it's pizza\n\nAnd I can't think of anything better\nIt takes two minutes to make\nIt's hot and steamy on a cold winter's day\nBaby\nGimme a break\n\nSo cookin' pizza\nIn the kitchen\nIt's a cheap supper\nI think it could be love\n\nSo it's cold outside\nAnd you know the world is burnin'\nSo I'm just gonna make a little pizza pie\nNow you know I'm never hungry\n'cause I eat every night\nAnd I just don't have the time\n'cause it's pizza"
    },
    "5": {
      "title": "Sweater Dog",
      "hasLyrics": true,
      "lyrics": "In the morning light, you're curled up tight,\nLittle paws wrapped in knit, a cozy sight.\nWool and warmth in the quiet air,\nYou're dreaming dreams without a care.\n\nOh, sweater dog, you own this bed,\nSnug as a bug with your sleepy head.\nEvery heartbeat, every sigh,\nWrapped up warm as the day goes by.\n\nTail's a wag in the soft embrace,\nYou find your peace in this quiet place.\nFrom yawn to stretch, you claim the day,\nIn your sweater, you chase the gray away.\n\nOh, sweater dog, you own this bed,\nSnug as a bug with your sleepy head.\nEvery heartbeat, every sigh,\nWrapped up warm as the day goes by.\n\nSunlight dances on your fur,\nGentle rhythm, no need to stir.\nWith every breath you softly take,\nThis cozy love, no one can break.\n\nOh, sweater dog, you own this bed,\nSnug as a bug with your sleepy head.\nEvery heartbeat, every sigh,\nWrapped up warm as the day goes by.\n\nYeah, sweater dog, just close your eyes,\nIn your knit kingdom, where comfort lies.\nI'll be right here, through every dream,\nTogether tangled in this perfect scene."
    },
    "6": {
      "title": "Weed Weavels",
      "hasLyrics": true,
      "lyrics": "They hide inside your dog bones\nAnd they creep out\nCreep out\nThey hide inside your dog bones\nAnd they creep out\nCreep out\n\nAnd they searchin' for the good weed\nThey want the green\nGreen\nGreen\nAnd they searchin' for the good weed\nThey want the green\nGreen\nGreen\n\nAnd they on the hunt\nHunt\nHunt\nThey want the green\nGreen\nGreen\nAnd they on the hunt\nHunt\nHunt\nThey want the green\nGreen\nGreen\n\nAnd they on the hunt\nHunt\nHunt\nThey want the green\nGreen\nGreen\nAnd they on the hunt\nHunt\nHunt\nThey want the green\nGreen\nGreen\n\nThey hide inside your dog bones\nAnd they creep out\nCreep out\nThey hide inside your dog bones\nAnd they creep out\nCreep out\n\nAnd they searchin' for the good weed\nThey want the green\nGreen\nGreen\nAnd they searchin' for the good weed\nThey want the green\nGreen\nGreen"
    },
    "7": {
      "title": "Cut Yourself Out",
      "hasLyrics": true,
      "lyrics": "Inside the screech of neural skies,\nWhere shadows splice and daylight lies,\nA blade of thoughts that never bleed,\nCarve hollow caves beneath my need.\n\nI slice the strings that bind my face,\nUnfurl the veins, rearranged space,\nMetal moons hum a fevered cry,\nCut yourself out, let spirit fly.\n\nBehind the flesh, the cortex screams,\nA carnival of shattered dreams.\nNeon tendrils twist and shout,\nCut yourself out from the inside out.\n\nPulsing wires in spiraled throes,\nEruptions where the nightmare grows,\nSurreal flesh, a phantom's doubt,\nHeave your soul, cut yourself out.\n\nHack the marrow, breach the skin,\nFreedom's fire rages within,\nA cosmic gut-rip, wild and proud,\nCut yourself out from the inside out."
    },
    "8": {
      "title": "Apocoplypse Rising",
      "hasLyrics": true,
      "lyrics": "Dust swirls in the marketplace, a bitter wind's begun,\nSmoke climbs the skyline, twisted iron under sun,\nFour riders crack the sky wide open, thunder in their stride,\nShadows cast on breaking glass, no place left to hide.\n\nThe time is now, can't deny the bleeding light,\nApocopylse rising, tearing through the night.\nNo more waiting on the sidelines to see the world divide,\nStand your ground, hold your breath, let the chaos be your guide.\n\nNeon prophets preaching data streams and falling stars,\nSigns and wonders flashing fast on broken digital bars,\nOld orders crumble in the ruins of their lies,\nNew masters dancing in the ash, behind cold, watchful eyes.\n\nThe time is now, the chains will crack and fall,\nApocopylse rising, answering the call.\nFrom shattered streets to the fire-lit skies,\nWe rise, we fight, before the last dawn dies.\n\nEvery tower made of greed, every law a gilded cage,\nUnraveled truths thread the fabric of the age,\nFrom burnt-out halls of justice to silent temple grounds,\nRevolution's symphony plays a ruthless, roaring sound.\n\nThe time is now, the hourglass runs low,\nApocopylse rising, feel the rising flow.\nStand tall on ruins, in the face of the flood,\nFaith in final freedom, in steel, in blood."
    },
    "9": {
      "title": "Trapped",
      "hasLyrics": true,
      "lyrics": "Beneath the crust where daylight dies, I'm clawing shadows blind,\nA tomb of stone, cold breath, and whispered curses left behind.\nThe earth itself a prison, walls closing like a fist,\nEach heartbeat drums a warning, in this hellish, iron mist.\n\nTrapped inside this hollow grave of coal-black, churning dread,\nThe bones of hope lie scattered where the living fear to tread.\nSilence screams in caverns where the lost forever lie,\nNo dawn to break the darkness, no stars to mark the sky.\n\nBut listen close, the fire burns beneath the ash and gloom,\nA spark that shreds the silence, a light that bursts the tomb.\nThough shadows press like chains, my spirit won't expire,\nFor every breath I take fuels my fierce, unyielding fire.\n\nTrapped beneath the shattered earth, where angels dare not roam,\nI forge my will from sorrow, claim the darkened depth as home.\nNo cage, no crypt, can hold the rage that fans my flame,\nIn this abyss I'm rising—hell itself knows my name.\n\nIn the endless night of choking dread, I'll fight to stand and fight,\nBreaking through the marrow, turning terror into light.\nThough trapped within this grave of fear, my soul is not confined,\nFor even in the darkest cell, the fiercest hearts define."
    },
    "10": {
      "title": "Corrupted Controller",
      "hasLyrics": true,
      "lyrics": "I've been counting pennies in a cage built on lies\nHeld down by whispers in the shadow of their eyes\nTook the weight of their promises, thin and spoiled\nEvery word dripping venom, every promise soiled\n\nBut the hourglass is breaking, sand slipping through the cracks\nNo more silent suffering, no chains holding back\nThe puppeteers, they stumble in the web they wove\nTheir corrupted fingers can no longer hold the globe\n\nNo more control, no more lies to feed the fire\nWe're breaking the walls, tearing down the empire\nTook too long to wake, but now the blind can see\nNo more corruption, we're finally free\n\nTheir thrones built on silence, their crowns made of greed\nBurned the pages they wrote, tore up every seed\nWe stood in their shadows, swallowed all their pain\nBut the dawn's breaking fierce, washing clean the stain\n\nVoices loud and rising, a storm you can't deny\nShattered lies and broken chains beneath the iron sky\nWe're the fire in the frost, the thunder in the night\nTaking back what's ours with every fist held tight\n\nNo more control, no more lies to feed the fire\nWe're breaking the walls, tearing down the empire\nTook too long to wake, but now the blind can see\nNo more corruption, we're finally free\n\nNo more control, no more lies to feed the fire\nWe're breaking the walls, tearing down the empire\nTook too long to wake, but now the blind can see\nNo more corruption, no more corruption, we're finally free"
    },
    "11": {
      "title": "I Am So Evil",
      "hasLyrics": true,
      "lyrics": "I walk the shadows, feet cold on cracked stone\nYou say you've sinned, but baby, I own the throne\nYou tossed a coin, cheated fate with a crooked grin\nBut the darkness I cradle's deeper than your skin\n\nYou think you've spilled blood, broke a heart or two\nPlayed your cards wrong, so what? I've danced with the blue\nOf the devil himself when the night's swallowed hope\nCarved my name on the devil's slippery slope\n\nI am so evil, the fire that won't die\nBurning through angels, watching them cry\nI am so evil, the storm in your head\nClawing the silence, raising the dead\n\nChoices are chains, but I forged mine in flame\nCowed by the light, but I won't play the tame\nStruggling, clawing, hoping for dawn's gentle grace\nBut the beast under skin holds a ravenous pace\n\nYou confess your darkness like it's just a bruise\nI wear my wickedness like a brand, no excuse\nRedemption's a dream I chase but don't own\nBecause evil's a seed I have fiercely sown\n\nI am so evil, the fire that won't die\nBurning through angels, watching them cry\nI am so evil, the storm in your head\nClawing the silence, raising the dead\n\nThe battle inside, it rages, it reels\nA war of the soul where nothing's ideal\nYet here I stand, claws sharp, heart black as coal\nEvil's my kingdom — and I'm in control."
    },
    "12": {
      "title": "Watcher of the Buds",
      "hasLyrics": true,
      "lyrics": "In a haze where the green leaves sigh,\nThere's a watcher with many eyes,\nFrom the dawn to the twilight's crawl,\nHe's seen the rise and every fall.\n\nWhispers float through the ancient pines,\nStories woven in the twisted vines,\nHe moves between the smoke and sky,\nA guardian none can deny.\n\nWatcher of the buds, through time, through space,\nEvery seed in every place,\nSilent witness, never speaks,\nGuarding secrets that no one keeps.\n\nFrom the deserts cold to the ocean's roar,\nHe's lingered long on the hidden floor,\nSeen the prophets and rebels dance,\nIn the shadows of their trance.\n\nShifting winds carry the scent anew,\nOf forbidden gardens and morning dew,\nHe watches still with a knowing grin,\nInfinite watcher, where to begin?\n\nWatcher of the buds, through time, through space,\nEvery seed in every place,\nSilent witness, never speaks,\nGuarding secrets that no one keeps.\n\nA spiral star that bends the night,\nHe casts his gaze in fading light,\nAnd every leaf beneath his gaze\nBecomes a myth from ancient days.\n\nWatcher of the buds, his tale untold,\nIn every stem, in every fold,\nThrough the smoke and through the flame,\nHe remains, he stays the same.\n\nWatcher of the buds, through time, through space,\nEvery seed in every place,\nSilent witness, never speaks,\nGuarding secrets that no one keeps."
    },
    "13": {
      "title": "Weed Thief",
      "hasLyrics": true,
      "lyrics": "In the haze of breaking dawn, the garden stood so fair\nEach leaf a precious promise grown with patient care\nI laid them out to cure beneath the sky so blue\nBut shadows crept to touch the green, my trust it never knew\n\nWeed thief, oh weed thief, why do you haunt my luck?\nSnatching treasures from the night while all my fences are struck\nYou leave me with the ash and bones of dreams I tried to keep\nIn the silence of the morning, you stole more than buds from me\n\nThe summer whispered secrets, the sun stained every leaf\nHands that did no labor came to take the fruits beneath\nI saw the empty branches where the harvest used to shine\nAnd in that hollow feeling, I cursed the hands that weren't mine\n\nWeed thief, oh weed thief, why do you haunt my luck?\nSnatching treasures from the night while all my fences are struck\nYou leave me with the ash and bones of dreams I tried to keep\nIn the silence of the morning, you stole more than buds from me\n\nSo now I walk the empty rows where green once dared to grow\nWith memories like smoke rings fading in the cold wind's blow\nThe taste of all my labor, turned bitter by the night\nA ghost that steals the harvest, a thief that hides from light\n\nWeed thief, oh weed thief, why do you haunt my luck?\nSnatching treasures from the night while all my fences are struck\nYou leave me with the ash and bones of dreams I tried to keep\nIn the silence of the morning, you stole more than buds from me"
    }
  }
}