{
  "albumId": "Steel On Asphalt",
  "albumTitle": "Steel On Asphalt",
  "tracks": {
    "1": {
      "title": "Steel On Asphalt",
      "hasLyrics": true,
      "lyrics": "Dust bites the cracked glass, cold wind in my face\nRadio hums a lonesome tune, lost out in this place\nSteel under my hands, rolling through the night\nEvery mile's a memory burning down the fading light\n\nBlacktop scars beneath the sky, stories caught in the dust\nA rebel's heart keeps beating to the sound of rust\nEngines sing like ghosts, whispering tales untold\nIn the quiet of the highway, I'm a part of this road\n\nWhite lines keep sliding under my wheels, they never lie\nChasing dreams that fade like smoke as the hours fly\nSteel on asphalt, it's a preacher and a friend\nLong roads and loud nights, they'll see me till the end\n\nNeon signs flicker, but I'm a shadow in the rearview\nGhost stories told in brake lights, every road I've been through\nHard lessons wrapped in miles, the price of staying free\nA restless kind of freedom's all this life will ever be\n\nWhite lines keep sliding under my wheels, they never lie\nChasing dreams that fade like smoke as the hours fly\nSteel on asphalt, it's a preacher and a friend\nLong roads and loud nights, they'll see me till the end\n\nThis road is a lover, and the engine's my prayer\nIn the hum of the highway, I find comfort there\nNo home but the horizon, no peace but the ride\nJust steel on asphalt, and the damage inside\n\nWhite lines keep sliding under my wheels, they never lie\nChasing dreams that fade like smoke as the hours fly\nSteel on asphalt, it's a preacher and a friend\nLong roads and loud nights, they'll see me till the end"
    },
    "2": {
      "title": "Coffee and Chrome",
      "hasLyrics": true,
      "lyrics": "Cold cup's been sittin' since last night's slow drag,\nNeon bleeds red on cracked linoleum and ash.\nOld Tom's singin' to a jukebox that don't care,\nWhile a crowbar's crackin' open secrets in the stale air.\n\nCoffee and chrome, lost souls and small-time fate,\nSpillin' their stories 'round this mismatched gate.\nSmoke rings curl like ghosts that won't let go,\nIn the backseat shadows where the busted radios blow.\n\nFaded overalls, eyes like cracked glass,\nHustlin' hard 'cause tomorrow's just another pass.\nThe lady behind the counter's counting her worn-out dreams,\nWhile a kid bets quarters on some half-baked schemes.\n\nLaughter's a trigger, but it's empty and dry,\nMixes with cussin' and the scent of last night's lie.\nTales get thicker, like the grease on the floor,\nEveryone's just waiting for the sun to close the door.\n\nCoffee and chrome, lost souls and small-time fate,\nSpillin' their stories 'round this mismatched gate.\nSmoke rings curl like ghosts that won't let go,\nIn the backseat shadows where the busted radios blow.\n\nA one-eyed clock ticks like it's just about done,\nCounting the wreckage of lives on the run.\nOutside the windows, a world still asleep,\nInside this refuge for the ones too lost to keep.\n\nCoffee and chrome, lost souls and small-time fate,\nSpillin' their stories 'round this mismatched gate.\nSmoke rings curl like ghosts that won't let go,\nIn the backseat shadows where the busted radios blow."
    },
    "3": {
      "title": "Smokey's Around the Bend",
      "hasLyrics": true,
      "lyrics": "Burnin' rubber on a weekend run,\nEyes peeled tight 'cause the game's begun,\nRadio cracklin' – \"Breaker one-nine,\"\nSmokey's lurking close, like a bloodhound on a line.\n\nRadar detector hummin' in my dash,\nGot the desert heat and a lightning flash,\nBig rig rollin' with a devil's grin,\nBackroad shortcut where the outlaw grins.\n\nSmokey's around the bend, better watch your speed,\nHe's got the blues and reds, hunger for the lead,\nBut I dance on throttle, play the cat and mouse,\nOne quick glance rearview, heart races in my house.\n\nHighway scams and crooked ways,\nCallin' code names in the smoky haze,\n\"Bear on the porch,\" they whisper low,\nGotta stay sharp if you wanna blow.\n\nRun the drugs or booze or weapons tight,\nRisky business in the dead of night,\nLaw's gotta get lucky once, that's the game,\nBut I'm burnin' coal in this runaway flame.\n\nSmokey's around the bend, hear the siren wail,\nBut it's my road, my rules, like a bull outta jail,\nIf I pull over, got nothing but a grin,\nJust a rebel wheelin' free with fire within.\n\nChasin' freedom down each blacktop vein,\nThrottle wide open, breakin' chains,\nNothin' sweeter than a clean escape,\nLivin' on the edge, that outlaw shape.\n\nSmokey's around the bend, but I'm ahead,\nRide that rumble, nothin' to dread,\nCB chatter fade into the night,\nJust me and this rig and the neon light."
    },
    "4": {
      "title": "Rustbelt Reflections",
      "hasLyrics": true,
      "lyrics": "The diesel hum fades down these cracked highways,\nGhost towns breathe rust in the dry morning haze,\nFactory bones lie bare beneath cold iron skies,\nSteel hearts shattered, no one hears their cries.\n\nI roll past the diner where Mama used to smile,\nHer hands worked hard but she stayed all the while,\nUnion ghosts whisper through the cracked windowpanes,\nSongs of promises drowned out by the rain.\n\nAnd I'm searching the glass for some spark of light,\nA flicker of meaning in the dying night,\nThe rearview's a mirror of what I've become,\nA silhouette chasing a setting sun.\n\nRustbelt reflections in the taillight glow,\nBroken dreams stacked like coal in the snow,\nAnger like a freight train rolling through my veins,\nHope's a faded sign on a forgotten lane.\n\nThe corner store's empty, the mural's worn thin,\nLast laugh's on the pavement where we used to spin,\nBarstools remember the battles, the pain,\nSmoke rings rising, clouding the rain.\n\nI clutch the wheel like I'm holding onto time,\nEvery mile a story, every scar a line,\nThe highway stretches, but it don't make amends,\nJust another road with no promised end.\n\nRustbelt reflections in the taillight glow,\nBroken dreams stacked like coal in the snow,\nAnger like a freight train rolling through my veins,\nHope's a faded sign on a forgotten lane.\n\nI'm battered but breathing, and I keep on this ride,\nLost towns, lost dreams, but I'm still alive,\nThe dust settles slow on the places I've known,\nSearching for home on a road paved with stone."
    },
    "5": {
      "title": "Truck Stop Surfer",
      "hasLyrics": true,
      "lyrics": "The neon flickers low above a diner's sigh,\nShe's tucked in a cracked booth where the lonely ride and cry.\nCoffee's gone cold but the longing's still hot,\nTracing circles on the table where the midnight tangled knot.\n\nHeadlights cut the rain like a shard through the night,\nShe's hitching her fate on the back of someone's headlights.\nA nod, a quick smile, hands fumbling for the door,\nWarmth in a stranger's rig but her soul's still on the floor.\n\nCash slips like whispers, quiet and thin,\nBarstool confessions where the race never ends.\nEvery glance's a token in this fading trade,\nTruck stop surfer in the dark, just trying to get paid.\n\nNo promises spoken, just the cold and the hush,\nTwo wanderers tangled in the stillness, a temporary crush.\nShe's rolling on a blade and chasing a dawn that won't stay,\nA silhouette fading down the endless runaway.\n\nHearts like freight cars weighed under moonlit scars,\nPassing like ghosts beneath the southern stars.\nNo love lost, no blame—just a deal and a flame,\nTruck stop surfer, riding the rails of the night again."
    },
    "6": {
      "title": "10-4, Over and Out",
      "hasLyrics": true,
      "lyrics": "Breaker one-nine, the night hums low and slow\nGot a rig rolling steady through the desert's glow\nStatic hums a welcome, ghost lines come through\nOld Smokey's out there watching, you best watch what you do\n\n\"Pig on the hill,\" the voice crackles soft and rough\nJokes about the diner, and a laugh that's just enough\nTo keep you rolling forward when the hours drag on\nThe dial's your confessional, where the lost get found\n\n10-4, over and out, you're never alone on this route\nLonely miles got company, in the voices you meet\nFrom a thousand miles away, to the next truck stop café\nWhere stories stick like tar and the night's bittersweet\n\n\"Big Daddy's here, watch that turn,\" a warning in the dark\nFollow the dance of taillights, through the rain and sparks\nAnd the phantom songs of handles never quite the same\nNames like Dusty Ridge or Bluebird callin' out by name\n\nLaughter breaks the static, a soft, familiar sound\nTales of broken radios, and towns that die around\nThe endless stretch of highway, where the lonely find a friend\nA brother, or a sister, on a signal that won't end\n\n10-4, over and out, you're never alone on this route\nLonely miles got company, in the voices you meet\nFrom a thousand miles away, to the next truck stop café\nWhere stories stick like tar and the night's bittersweet\n\nAnd when the morning finds me, by the amber glow of dawn\nI'll carry all these voices, in the silence when they're gone\nA pact of rolling strangers, in the static and the shout\nWe're all connected, 10-4, over and out."
    },
    "7": {
      "title": "Load to Bear",
      "hasLyrics": true,
      "lyrics": "Steel wheels humin' down the long blacktop,\nA trailer full of burdens I can't drop.\nBack aches sharper than a rusty nail,\nBills stackin' higher, like a ghostly trail.\n\nThe kids grow up in a cracked rearview,\nMissin' birthdays that I never knew.\nEvery mile's a prayer and a whispered sin,\nSecrets packed tight under my skin.\n\nI can take it, keep the wheels turnin' slow,\nBut Lord, it gets heavy, this load I know.\nI can bear it, till the morning air,\nBut oh, this load's hard to wear.\n\nDeadlines hammer like a midnight train,\nA heart half full of freight and pain.\nDreams I chased now rust and fade,\nLike faded signs on the highway shade.\n\nCold coffee and a cigarette's last glow,\nLonely nights that nobody knows.\nEyes on that horizon's stubborn light,\nPrayin' for mercy in the cracked twilight.\n\nI can take it, keep the wheels turnin' slow,\nBut Lord, it gets heavy, this load I know.\nI can bear it, till the morning air,\nBut oh, this load's hard to wear.\n\nSteel and sorrow bound tight as kin,\nLivin' every mile with the weight within.\nA slow dance with a freight that's never done,\nCarryin' all the pieces of what I've become.\n\nI can take it, keep the wheels turnin' slow,\nBut Lord, it gets heavy, this load I know.\nI can bear it, till the morning air,\nBut oh, this load's heavy to wear."
    },
    "8": {
      "title": "Dispatch Blues",
      "hasLyrics": true,
      "lyrics": "Well the phone's ringing red, another crack in my soul\nGuy on the other end don't know my rig from a coal\nSays, \"Take this load, make it quick\" like he's never seen the road\n\"Just do one more run,\" like I ain't gonna unload\n\nPapers all mismatched, like a snake in a suit's game\nRoutes so screwed up, feel like I'm chasing my own name\nHe don't know no dirt, just a voice in a box\nTossin' orders like he's playin' with an innocent fox\n\nOh we're all just numbers shoved in corporate shoes\nGot the dispatch blues, hell I'm payin' my dues\nRaise a glass to the road and the lies that it brewed\nWe're howlin' out loud with the dispatch blues\n\nSidebar on the CB, a chorus of sighs\nOld timers cynic, rattlin' their tired eyes\n\"Hey boss, you ever been stuck in a cafe at hour three?\"\n\"Nope, but here's your next line, buddy, don't bother me\"\n\nLoad's a mess, directions all fuzzed\n\"Turn left at the cow field,\" but the cow's been lost\nSend me miles out in the dust, then ask why I'm late\nI'm a cowboy ghost in a digital freight crate\n\nOh we're all just numbers plugged into their stews\nDancin' to orders from these pencil thin screws\nWith a middle finger raised, singin' 'bout the ruse\nGot the dispatch blues, yeah, the dispatch blues\n\nWell I swear to the moon, someday I'll hang up that phone\nFind a patch of dirt I can call my own\nTill then I'll keep spittin' through this neon fuss\nA rebel stuck in the grid, sayin', \"Just one more run for us\"\n\nSo here's to the drivers with dust in their veins\nFightin' the suit's game with the might of our chains\nWe're cursing the routin', the endless demands\nBut we keep rollin' on, with grit in our hands\n\nOh we're all just numbers with nothing to lose\nSingin' bitter and low 'bout the dispatch blues\nA howl in the night for the worn and the bruised\nHere's to livin' on the edge with the dispatch blues."
    },
    "9": {
      "title": "Broken Sleep",
      "hasLyrics": true,
      "lyrics": "I'm parked off the side at the old Pine Creek rest area\nFingertips numb from the cold glass, radio's crackling low\nStrange midnight station humming, a dead man's lullaby\nDreams tangled up in the white lines, drifting where I shouldn't go\n\nEyes half-open, half-blinking in the cab's faint blue glow\nLogbook pages curl like the roads I never get to slow\nWoke up sore, with reefers breathing through the dark night\nJake brakes tapping Morse code on steel, my only company 'til light\n\nBroken sleep on a steel horse running down the endless black\nAlways one eye on the mirror, one foot on the clutch and gas\nToo tired to rest, too wired to crash, caught in the same old fight\nAlone with my shadow, chasing dawn through the night\n\nMind's a restless traveler, heart's a freight train full of ghosts\nEvery mile digs a new hole in the man I used to own\nFaded dreams in the backseat, promises I can't keep\nThe open road's a cruel friend when you're chained to broken sleep\n\nBroken sleep on a steel horse running down the endless black\nAlways one eye on the mirror, one foot on the clutch and gas\nToo tired to rest, too wired to crash, caught in the same old fight\nAlone with my shadow, chasing dawn through the night\n\nAnother roadside church, another prayer left unsaid\nThe highway's hymn keeps playing, a song for the half-dead\nLogbook's full of numbers, but it's miles that count most deep\nThe cost of being free is a lifetime of broken sleep"
    },
    "10": {
      "title": "Backroad Blessing",
      "hasLyrics": true,
      "lyrics": "Pulling off the interstate, headlights fade to dark\nThat gravel road's a welcome sign, a beacon to my heart\nThe whisper of your slow breath, kids tangled in sheets\nThe world can wait outside this door where love and quiet meet\n\nHands that rough the miles, find their way back home\nThe scent of your kitchen lingers like a prayer in the air alone\nI trace the lines of worn-out maps, but tonight I'm found instead\nIn a stolen night of laughter where the highway's miles tread\n\nBackroad blessing, under fading stars\nA borrowed hour, held in your arms\nThe clock keeps ticking, but here I'm whole\nIn this moment, I'm never letting go\n\nMorning slips through window cracks, the dawn a gentle thief\nKids' sleepy smiles a sacred weight, my heart's bittersweet relief\nThe rumble calls me back again, the diesel breathes my name\nBut I'll carry you like a sacred flame through the endless black and rain\n\nBackroad blessing, under fading stars\nA borrowed hour, held in your arms\nThe clock keeps ticking, but here I'm whole\nIn this moment, I'm never letting go\n\nSo I'll chase the miles, and dream of this place\nWhere time stood still for your warm embrace\nA rare twist of fate, a gift from the road\nA night to remind me where my heart is stowed\n\nBackroad blessing, under fading stars\nA borrowed hour, held in your arms\nThe clock keeps ticking, but here I'm whole\nIn this moment, I'm never letting go"
    },
    "11": {
      "title": "Breaker Breakdown",
      "hasLyrics": true,
      "lyrics": "Well I'm sittin' on the side of this goddamn road again\nHood up, busted hose, rain's pourin' like a sin\nBusted knuckles on the wrench, oil stains on my jeans\nSwearin' at the sky, but it don't hear my mean\n\nTalked to some joker on the line, said \"help is on its way\"\nBeen two hours and the clock just laughs, teasing me to stay\nA man pulled up slow, said \"need a hand?\" with a grin so wide\nBut he just dropped my tools and left, said he had to catch a ride\n\nI patch it with duct tape and whatever I can find\nThis beast's got scars, but it's still mine to drive, God damn\nFlat tire's spinning, but my stubborn heart won't break\nI'm a mile-maker, liar, built from all these mistakes\n\nBreaker breakdown, damn near lost my mind\nBut I'm still punchin' through the wreck and the grind\nIn the middle of nowhere with no goddamn clue\nBreaker breakdown, but hell, I'll make it through\n\nRain's soaking deep, and the mud's tryin' to claim me whole\nBut I've got grease in my blood, fire still burns in my soul\nDispatch don't care, their voice is just static and lies\nI'm chokin' on cigarettes, swearing but I still rise\n\nThen headlights cut the dark, salvation rolls near\nBut pride whispers low—\"You fixed it, no need to fear\"\nSo I crank this engine, roar back into the night\nBreaker breakdown won't keep me down, not without a fight\n\nBreaker breakdown, damn near lost my mind\nBut I'm still punchin' through the wreck and the grind\nIn the middle of nowhere with no goddamn clue\nBreaker breakdown, but hell, I'll make it through\n\nHell yeah, I'll make it through."
    },
    "12": {
      "title": "Black Ice and Blind Curves",
      "hasLyrics": true,
      "lyrics": "Grease and gravel under my nails, midnight's pouring down cold,\nBlack ice creeping like a thief, on roads that don't fold,\nJackknifed rigs like fallen beasts, blocking the rearview scene,\nTwelve hours from nowhere, nowhere's where I lean.\n\nHands shake on the busted hose, steam's a crimson ghost,\nRain drums the cab like a preacher, pounding on a lost cause,\nThe needle's dancing on empty, the cold sweat on my face,\nPrayers whispered to the dashboard, begging for some grace.\n\nRide this chaos, grip the wheel, every sliver's a curse,\nPucker factor's biting hard on these blind curves.\nCan't quit the fight, can't lose the mile,\nPatch it up with pride and grit, keep burning that wild style.\n\nFlats like riddles in the night, spares that stubbornly bleed,\nTangled in the weeds of time, but still I got what I need,\nTowed by the patience of thunder, undermined but not through,\nSparks fly from a roadside hustle, got work and heart to prove.\n\nRide this chaos, grip the wheel, every sliver's a curse,\nPucker factor's biting hard on these blind curves.\nCan't quit the fight, can't lose the mile,\nPatch it up with pride and grit, keep burning that wild style.\n\nIt's the dawn on the horizon, rusted steel and cracked glass,\nEvery mile's a battle, every scar's gonna last,\nBut I'll ride these shadows till the black turns to gold,\nBecause in the wreck and the ruin, I'm the story told.\n\nRide this chaos, grip the wheel, every sliver's a curse,\nPucker factor's biting hard on these blind curves.\nCan't quit the fight, can't lose the mile,\nPatch it up with pride and grit, keep burning that wild style."
    },
    "13": {
      "title": "End of the Route",
      "hasLyrics": true,
      "lyrics": "The sun dips low behind the hills I've known for years,\nThe dust of a thousand highways clings to my worn-out gears.\nI've carried stories in the back of this old frame,\nFamiliar names and faces, each one burned into flame.\n\nThere's a quiet in the silence when the engine finally cools,\nA peace that swells inside, like the breaking of old rules.\nFriends I met along the way, some gone, some still around,\nTheir laughter rides the evening breeze, a soft and steady sound.\n\nEnd of the route, where the heart takes its rest,\nAll the miles and memories put to the test.\nRoads behind, a lifetime's worth of truth,\nI lay down my load—the end of the route.\n\nI remember waiting eyes on porches bright or dim,\nThe hands I never held, the chances left to skim.\nLessons learned in midnight talks and dawn's fading light,\nThe freight we hauled was heavy, but the spirit held on tight.\n\nNow the map is folded, tucked inside my chest,\nEach wrinkle and scar tells where I found my rest.\nNo more miles to travel, no more songs to sing,\nJust the sunset's amber glow and the peace that evening brings.\n\nEnd of the route, where the heart takes its rest,\nAll the miles and memories put to the test.\nRoads behind, a lifetime's worth of truth,\nI lay down my load—the end of the route.\n\nSo thank you for the ride, for the hands that helped me steer,\nFor every mile shared under starlit skies so clear.\nThe road may vanish now beneath the fading light,\nBut I carry every moment deep into the quiet night.\n\nEnd of the route, where the heart takes its rest,\nAll the miles and memories put to the test.\nRoads behind, a lifetime's worth of truth,\nI lay down my load—the end of the route."
    }
  }
}