{
  "albumId": "TimeCapsule",
  "albumTitle": "Time Capsule",
  "tracks": {
    "1": {
      "title": "Time Capsule",
      "hasLyrics": true,
      "lyrics": "Hey, hey, step right in, the door's unlocked,\nGot a rocket beat and a clock that's rocked,\nFlashy lights, neon nights, synths ignite,\nWe're blasting off, gonna ride this vibe tonight.\n\nSpin the dial, catch the wave, rewind the sound,\nFrom vinyl spins to beats that pound,\nGroove through the decades, electric sky,\nJoin the ride, don't be shy, come on, fly high.\n\nTime capsule's warm, the past is alive,\nEchoes of tomorrow, let's twist and dive,\nFeel that pulse, hearts align, we're synchronized,\nEvery note's a story, come and realize.\n\nJump in the time capsule, hold on tight,\nDancing through decades, a wild delight,\nFrom disco balls to synth-pop's glow,\nWe're the rhythm makers, ready to blow.\n\nBass kicks in, then the drums attack,\nFlashback fever on this stellar track,\nMirror balls spin like a cosmic dance,\nTake this chance, it's your moment, advance.\n\nTime capsule's glow, electric and bright,\nWe own the past, we own the night,\nWith every beat, we break the mold,\nA musical journey worth more than gold.\n\nJump in the time capsule, hold on tight,\nDancing through decades, a wild delight,\nFrom disco balls to synth-pop's glow,\nWe're the rhythm makers, ready to blow.\n\nYeah, step inside and never look back,\nRiding this wave on the neon track,\nTogether we launch, the future's in sight,\nIn this time capsule, we own the night."
    },
    "2": {
      "title": "Roaring 20s Redux",
      "hasLyrics": true,
      "lyrics": "In a city dressed in velvet nights,\nWhere the moonlight spills in golden lights,\nFlappers spin tales in feathered pride,\nWhispers of jazz the secret guide.\n\nChampagne spills in crystal streams,\nDancing shadows chase their dreams,\nIn the heart of a speakeasy dive,\nThe roaring spirit comes alive.\n\nRaise your glass to the shimmering stars,\nGatsby's garden behind iron bars,\nSaxophones cry, the trumpets sway,\nWe live the magic of yesterday.\n\nSnap your fingers, tap your feet,\nThe night's alive with a sultry beat,\nUpright bass hums a midnight tune,\nPiano keys beneath the silver moon.\n\nFlashing smiles, the perfect guise,\nGlasses clink in a sweet surprise,\nTurn the dial back, let's rewind,\nTo jazz age parties, undefined.\n\nRaise your glass to the shimmering stars,\nGatsby's garden behind iron bars,\nSaxophones cry, the trumpets sway,\nWe live the magic of yesterday.\n\nOh, the city's heartbeat, wild and free,\nA symphony of mystery,\nUnderneath the velvet skies,\nThe roaring 20s never die.\n\nRaise your glass to the shimmering stars,\nGatsby's garden behind iron bars,\nSaxophones cry, the trumpets sway,\nWe live the magic of yesterday.\n\nToast to dreams that never fade,\nIn this jazzy masquerade,\nHere's to the night, our sweet rendezvous,\nRoaring 20s, we're back with you."
    },
    "3": {
      "title": "Jumpin' Jive (Lucky 30s)",
      "hasLyrics": true,
      "lyrics": "Kick off your shoes, let the evening take flight,\nTin roof tops hum under neon moonlight,\nDial up the magic, that radio serenade,\nGot tales of a golden age, never to fade.\n\nStep in the shimmer where the spotlights play,\nHollywood whispers callin' us away,\nFolks crowd the floor, jazz hands hold tight,\nIn the thunder of horns, we forget the night.\n\nJumpin' jive, baby, glide those blues aside,\nSwingin' streets hum with love and pride,\nRaise your glass to hope, in rhythm we thrive,\nThe beat's our shelter, we come alive.\n\nHear that scratch, that spin, on vinyl it rides,\nCrooners and brass in perfect collides,\nThrough the haze of a world gone wild,\nTogether we're strong, every man, every child.\n\nJumpin' jive, baby, glide those blues aside,\nSwingin' streets hum with love and pride,\nRaise your glass to hope, in rhythm we thrive,\nThe beat's our shelter, we come alive.\n\nSo dance with me now, let the hard times slide,\nIn this dance hall of dreams, we can't hide,\nFrom city streets to the grand marquee,\nIt's jazz, it's soul—it's a community.\n\nJumpin' jive, baby, glide those blues aside,\nSwingin' streets hum with love and pride,\nRaise your glass to hope, in rhythm we thrive,\nThe beat's our shelter, we come alive."
    },
    "4": {
      "title": "Victory Stomp (40s)",
      "hasLyrics": true,
      "lyrics": "The band starts swinging, hear that trumpet call,\nBoots on the pavement, breaking down the wall,\nFrom London fog to the Paris streets,\nEvery heart's a drum, every smile's a beat.\n\nVictory stomp, clap your hands, feel the night alive,\nSpin your partner 'round, watch the hope arrive,\nRaise your voices high, let the chorus play,\nWe dance the dark away, peace is on the way.\n\nSteel will unbroken, though the skies were gray,\nLetters from home, keep the fear at bay,\nSisters and brothers, side by side we stand,\nMoving to the rhythm of a promised land.\n\nVictory stomp, clap your hands, feel the night alive,\nSpin your partner 'round, watch the hope arrive,\nRaise your voices high, let the chorus play,\nWe dance the dark away, peace is on the way.\n\nHear the joyful echoes from the towns and farms,\nSwinging in the moonlight, arms wrapped in arms,\nThe flag waves freely, waving through the strife,\nDancing into glory, stepping into life.\n\nVictory stomp, clap your hands, feel the night alive,\nSpin your partner 'round, watch the hope arrive,\nRaise your voices high, let the chorus play,\nWe dance the dark away, peace is on the way.\n\nVictory stomp, clap your hands, swing to brighter days,\nTriumph in our hearts, in this joyful blaze,\nLift your spirits high, in sweet harmony,\nTogether we stand, forever free!"
    },
    "5": {
      "title": "Sock Hop Serenade (50s)",
      "hasLyrics": true,
      "lyrics": "Cruisin' down the boulevard in your cherry red machine\nShining chrome and leather seats, like a movie scene\nJukebox hummin' softly, doo-wop on the breeze\nEvery note's a spark that sets my heart at ease\n\nMilkshake smiles, strawberry lips, taste the summer heat\nSneaking glances in the dark, where love and rhythm meet\nUnderneath the neon glow, our shadows dancing close\nIn this sock hop serenade, you're the one I want the most\n\nSpin me 'round, spin me 'round, in this flicker of the night\nTurn the dial, hear that sound, feel the music take its flight\nRock'n'roll revolution, hearts in sweet parade\nHold me tight, baby, in our sock hop serenade\n\nYour hand in mine, like vinyl smooth and true\nEvery beat an echo of the love I found in you\nClassic cars and midnight stars, our secret rendezvous\nA timeless dance in a world that's made for two\n\nMilkshake sweet and cherry red, dancing through the years\nJukebox plays our favorite song, wiping all the tears\nIn this drive-in dream, you're my melody\nForever caught in this sweet symphony\n\nSpin me 'round, spin me 'round, in this flicker of the night\nTurn the dial, hear that sound, feel the music take its flight\nRock'n'roll revolution, hearts in sweet parade\nHold me tight, baby, in our sock hop serenade\n\nHold me tight, baby, in this sock hop serenade…"
    },
    "6": {
      "title": "Flower Groove (60s)",
      "hasLyrics": true,
      "lyrics": "Sunset paints the city gold,\nSan Francisco dreams unfold,\nBarefoot steps on earthy ground,\nVoices rise, a sacred sound.\n\nHands entwined beneath the sky,\nWhispered hopes that never die,\nColors bloom in every soul,\nHearts ignite to make us whole.\n\nFlower groove, in fields we sway,\nLove's a song we sing today,\nPeace in every breath we move,\nDancing in the flower groove.\n\nEchoes of a distant call,\nWoodstock nights that still recall,\nDreamers marching side by side,\nChanging tides we can't divide.\n\nTambourines and gentle rhymes,\nCarry through the hands of time,\nHarmony a sweet embrace,\nIn this peaceful, tender space.\n\nFlower groove, in fields we sway,\nLove's a song we sing today,\nPeace in every breath we move,\nDancing in the flower groove.\n\nLet the morning light renew,\nWhat the old world never knew,\nIn the garden where we stand,\nFreedom blooms at our command.\n\nFlower groove, in fields we sway,\nLove's a song we sing today,\nPeace in every breath we move,\nDancing in the flower groove."
    },
    "7": {
      "title": "Disco Inferno (70s Fever)",
      "hasLyrics": true,
      "lyrics": "Step into the light where the mirror balls spin,\nShimmer in your platform shoes, let the fever begin,\nBassline thumping like your heart on fire,\nStrings slicing smooth, taking you higher.\n\nGlitter in the air, neon in your eyes,\nDancefloor's calling out, no room for disguise,\nShake it like Lizzo, groove like Nile's guitar,\nTonight we own this disco star.\n\nDisco inferno, burning up the night,\nFunk in every move, feel the magic ignite,\nSpin me 'round the room, keep that rhythm alive,\n70s fever's here, let's come alive!\n\nBreak out the wah wah, funk guitar's the key,\nEvery step a revolution, every move is free,\nPlatform shoes stomping to the bass's command,\nWe're the kings and queens of this disco land.\n\nRaise your hands up high, let the music explore,\nNeon light reflections spinning on the floor,\nHeartbeat syncopated to the rhythm's embrace,\nWe don't stop groovin', we own this space.\n\nDisco inferno, burning up the night,\nFunk in every move, feel the magic ignite,\nSpin me 'round the room, keep that rhythm alive,\n70s fever's here, let's come alive!\n\nMirror balls cascade, lighting up the scene,\nDancing in a fever dream, so fresh, so clean,\nLizzo's fire, Nile's funky soul,\nTogether we ignite, making disco whole.\n\nDisco inferno, blazing 'til the dawn,\nFunky fever's raging — come and get it on,\nPlatform shoes and endless groove,\nWe bring the heat, don't lose the move!\n\nDisco inferno, burning up the night,\nFunk in every move, feel the magic ignite,\nSpin me 'round the room, keep that rhythm alive,\n70s fever's here—let's come alive!"
    },
    "8": {
      "title": "Neon Nights (Electric 80s)",
      "hasLyrics": true,
      "lyrics": "Flashin' lights and pixel fights, we're lost inside the arcade glow\nMolten nights, the city bites, thrift store shades and vinyl low\nGot Nirvana on the soundtrack, flannel ghosts in neon haze\nSlacker kings in combat boots, we're jukebox rebels out to blaze\n\nJoystick dreams and candy beams, rewindin' life in 8-bit waves\nCigarette sparks in mini skirts, pop culture rebels misbehave\nSynth pulse racing through the vein, electric hearts collide and race\nPixelated memories turn to gold inside this crowded space\n\nNeon nights, we come alive, electric pulses never die\nDancing under chrome-lit skies, we're fireflies in synth-pop highs\nNeon nights, let's ride the storm, arcade kings forever born\nIn this hyper-color storm, lost in the static, party's on\n\nCassette tapes and midnight escapes, caffeine shooting through our veins\nSlouching slow in thrift store clothes, with a soundtrack mixed in sugar cane\nCrash the scene with laser beams, slacker heroes in the glow\nRetro dreams and midnight schemes, plug me in, let's overload\n\nPixel hearts in overdrive, broken records rewind the time\nGame over never felt so right, crashed the system—take the night\n\nNeon nights, we come alive, electric pulses never die\nDancing under chrome-lit skies, we're fireflies in synth-pop highs\nNeon nights, let's ride the storm, arcade kings forever born\nIn this hyper-color storm, lost in the static, party's on\n\nFlash the screen, a silvery gleam, hold me close, let's chase the dream\nSynth-loaded, pop exploded, coming through the city seams\n\nNeon nights, we come alive, electric pulses never die\nDancing under chrome-lit skies, we're fireflies in synth-pop highs\nNeon nights, let's ride the storm, arcade kings forever born\nIn this hyper-color storm, lost in the static, party's on"
    },
    "9": {
      "title": "Grunge & Flannel (90s Nostalgia)",
      "hasLyrics": true,
      "lyrics": "Ripped jeans hang like flags from my window\nFaded flannel stitched with the years I don't know\nTap the screen, rewind a burnt-out soul\nNirvana whispering through the stereo glow\n\nCheap thrift store kings in tired leather boots\nSlacker anthems carved in our mute disputes\nMTV static, black-and-white confessions\nAngst turned to art, a neon obsession\n\nI'm a ghost in the feedback, a shadow in the roar\nScreaming in silence like the '90s before\nWe wear our wounds louder than a downbeat snare\nLost kids screaming in the smoke-filled air\n\nGrunge & flannel, bleed it raw and true\nAnger's the ink, rebellion's residue\nStatic rebellion on a cracked TV screen\nWe're the faded dream of a forgotten scene\n\nLocked in a loop of rebellion and rust\nSneering at the future, distrust and disgust\nWe built our empires on echoes and scars\nMTV monsters, chasing fallen stars\n\nTurn it up, let the chaos collide\nRadio burns with the rage we can't hide\nGrunge & flannel, the anthem that stays\nRebels rewriting the sad decade's haze\n\nGrunge & flannel, bleed it raw and true\nAnger's the ink, rebellion's residue\nStatic rebellion on a cracked TV screen\nWe're the faded dream of a forgotten scene"
    },
    "10": {
      "title": "Dot Com Dreams (Y2K Millennium)",
      "hasLyrics": true,
      "lyrics": "Flashin' screens, neon beams, dial up dreams ignite\nPixel hearts on AIM, typing through the night\nCyber pulse, electric rush, heartbeat syncs in code\nFuture's flashing in my eyes, download overload\n\nMidnight calls on dot com lines, yeah, we own the scene\nY2K countdown, life's a wild machine\nVocoder voices in the air, singing digital love\nNo fear in the millennium, stars are shining above\n\nHold tight, the future is now, we're breaking out the seams\nBit by bit, byte by byte, chasing dot com dreams\nWe're the kids of the new dawn, surfing cyber streams\nLight speed love on a neon wave, living dot com dreams\n\nHack the night with boy-band charm, charisma on fire\nGlitch and glam, electric jam, taking us higher\nBinary beats, dancing free, pixelated soul\nWe're wired up, unstoppable, on a Y2K roll\n\nHold tight, the future is now, we're breaking out the seams\nBit by bit, byte by byte, chasing dot com dreams\nWe're the kids of the new dawn, surfing cyber streams\nLight speed love on a neon wave, living dot com dreams\n\nFlash the code, spark the show, revolution's here\nOptimism overload, no time for fear\nFrom dial-up days to fiber phase, rising like a star\nY2K is just the start, we're taking it far\n\nHold tight, the future is now, we're breaking out the seams\nBit by bit, byte by byte, chasing dot com dreams\nWe're the kids of the new dawn, surfing cyber streams\nLight speed love on a neon wave, living dot com dreams"
    },
    "11": {
      "title": "Viral Vibes (2010s)",
      "hasLyrics": true,
      "lyrics": "Scrollin' up, scrollin' down, post it once, then it's gone,\nSnap a pic, make a vid, now the whole world's on,\nGot that spray paint drip, move that lip sync quick,\nWatch me hit 10K likes, yeah I'm 'bout to get lit.\n\nTikTok dances in my shoes, flossin' on that viral news,\nSwipe left, swipe right, catch the beat on every night,\nEmoji rain, heart-eyes fly, diamond chains in the pixel sky,\nWatch me blow up on your feed, viral vibes, yeah, that's my creed.\n\n🎉 Hit the jump, do the wave, all my haters lookin' brave,\nSnap that clap, do a spin, caught up in the meme again,\nClout chasin', no time for hatin', all these trends keep on creatin',\nLivestream poppin', chat explodin', viral vibes are always loaded.\n\nScrollin' fast, but I'm on beat, every post just can't be beat,\nLikes blow up, baring gold, every share's worth more than sold,\nFrom the dawn to midnight, feeds light up so tight,\nGot the world in my palm, this vibe is pure bomb.\n\n🎉 Hit the jump, do the wave, all my haters lookin' brave,\nSnap that clap, do a spin, caught up in the meme again,\nClout chasin', no time for hatin', all these trends keep on creatin',\nLivestream poppin', chat explodin', viral vibes are always loaded.\n\nDouble tap, gotta flex, viral life's the new complex,\nEmoji faces, heart eruptions, in this digital eruption,\nFlashin' lights, grindin' flex, on the rise in cyberspace,\nNo cap, this vibe's real, ride this wave, it's all surreal.\n\n🎉 Hit the jump, do the wave, all my haters lookin' brave,\nSnap that clap, do a spin, caught up in the meme again,\nClout chasin', no time for hatin', all these trends keep on creatin',\nLivestream poppin', chat explodin', viral vibes are always loaded."
    },
    "12": {
      "title": "Homebody Anthem (2020s New Normal)",
      "hasLyrics": true,
      "lyrics": "Flicker of the screen in the dark, another Zoom call starts\nLaughter packed in pixels, but I miss the beating hearts\nWearing masks like second skins, our smiles remain unseen\nTracing shapes on foggy glass where your breath used to lean\n\nBanana bread in the oven, timer counting down the days\nSilver linings in the chaos, little sparks in muted greys\nCounting miles in sleepless nights, your voice a half-heard tune\nTogether apart, we're dancing under this quarantine moon\n\nAnd I'll be your homebody anthem, soft and low and slow\nWaiting for the world outside to catch us as we grow\nIn this pause of everything normal, we find our own form\nIn the quiet, in the distance, love keeps us warm\n\nScrolling through our lists of dreams, dusty but still alive\nShared playlists and our whispered hopes help us survive\nLaundry piles and empty streets, echoes fill the space\nBut when your laughter breaks through, time can't keep pace\n\nAnd I'll be your homebody anthem, soft and low and slow\nWaiting for the world outside to catch us as we grow\nIn this pause of everything normal, we find our own form\nIn the quiet, in the distance, love keeps us warm\n\nSo here's to silver linings, and this strange new rhyme\nOf being close but distant, lost inside the time\nThough the nights feel longer, and the days rearranged\nI find you in the moments that haven't changed\n\nAnd I'll be your homebody anthem, soft and low and slow\nWaiting for the world outside to catch us as we grow\nIn this pause of everything normal, we find our own form\nIn the quiet, in the distance, love keeps us warm"
    },
    "13": {
      "title": "Back to the Future (Outro)",
      "hasLyrics": true,
      "lyrics": "Step inside the capsule of time, hearts beating in rhyme\nFrom roaring twenties' smoky rooms to jumps in jive sublime\nVictory stomps beneath the stars, sock hop serenades we find\nFlowers bloom, disco thunders, neon nights unwind\n\nEchoes of grunge in flannel worn, dot com dreams on fire born\nViral vibes that pulse and play, homebody warmth at break of dawn\nWe trace the steps, the notes, the sounds, a tapestry reworn\nSpinning wheels of past and now, to futures yet untorn\n\nHold the moments, catch the glow, from silent films to streaming shows\nEach beat a memory, each word a world we sew\nIn cycles spun by unseen hands, where yesterday meets the plans\nThe road ahead loops back again, where every ending starts to grow\n\nBack to the future, time's gentle dance, we're standing still in each new chance\nEyes wide open, hearts entwined, to write the stories left behind\nSo make the memories you want to keep, from whispered dreams to mountains steep\nThe past's a mirror, the future's light—both held in this endless night\n\nSing the song of neon streams, jazzy nights and pixel dreams\nFrom vinyl crackle to synth wave beams, the soundscape flows and gleams\nWe carry the rhythm, the silent hum, in every breath, the beat of drums\nTime bends, it breaks, it softly mends—where all beginnings come from ends\n\nBack to the future, here we stand, reaching out to hand in hand\nThe story's yours to sketch and weave, in every dawn we still believe\nIn all the moments we create, the love, the loss, the twist of fate\nThe journey spins, but one truth stays: the song unfolds, the music plays."
    }
  }
}